[
  {
    "hex_coord": [
      1,
      -2
    ],
    "country": 1,
    "MSU_ids": [
      1
    ],
    "summary": "The collection of sentences indicates a common theme related to the combustion process in scramjet engines, emphasizing its occurrence under unsteady conditions. The sentences likely discuss various aspects or challenges associated with combustion dynamics in scramjet engines, suggesting a focused discussion on this specific engineering subject."
  },
  {
    "hex_coord": [
      -10,
      3
    ],
    "country": 1,
    "MSU_ids": [
      2
    ],
    "summary": "The sentences suggest a common theme of studying flame unsteadiness in supersonic combustion, with a focus on both local and global manifestations. This cluster likely discusses different aspects of the impact and characteristics of flame unsteadiness in the context of supersonic combustion research."
  },
  {
    "hex_coord": [
      -9,
      5
    ],
    "country": 1,
    "MSU_ids": [
      3,
      29
    ],
    "summary": "The sentences extracted from the papers suggest a common theme of discussing unsteady processes in combustion, specifically focusing on reactant mixing, ignition, flame stabilization, and blow-off within the context of combustor configurations favoring low thrust loss and minimal aerodynamic heating. The relationship appears to be discussing different aspects related to combustion dynamics within combustors."
  },
  {
    "hex_coord": [
      6,
      -10
    ],
    "country": 1,
    "MSU_ids": [
      4,
      459
    ],
    "summary": "The two sentences extracted from the paper \"largeeddyMSU\" highlight the urgent need to address unsteady supersonic combustion in the context of scramjet engine applications, supported by consistent findings from previous analyses. The common theme centers on the significance of resolving challenges related to unsteady supersonic combustion for practical scramjet engine implementations."
  },
  {
    "hex_coord": [
      -9,
      -3
    ],
    "country": 1,
    "MSU_ids": [
      17
    ],
    "summary": "The clustered sentence implies a common theme of advancements in national research on near-space vehicles. The relationship among the sentences is likely specific, focusing on the progress and enhancements in this research field."
  },
  {
    "hex_coord": [
      -7,
      0
    ],
    "country": 1,
    "MSU_ids": [
      18
    ],
    "summary": "The common theme across the papers seems to focus on advancements in near-space vehicle research, specifically targeting improvements in flying speed and strike range. These sentences likely share a unified focus on the developments within this particular area of research."
  },
  {
    "hex_coord": [
      1,
      -4
    ],
    "country": 1,
    "MSU_ids": [
      19
    ],
    "summary": "The cluster of sentences indicates a common theme centered around the expanding research interest in the strategic capabilities of near-space systems. This suggests a collective focus on exploring and harnessing the strategic advantages offered by near-space technologies across different papers."
  },
  {
    "hex_coord": [
      -8,
      1
    ],
    "country": 1,
    "MSU_ids": [
      20
    ],
    "summary": "The sentences mention the Dual-Mode Scramjet (DMSJ) engine as a promising solution for achieving increased speed and range in propulsion systems. They likely discuss different aspects or advancements related to this type of engine, indicating a shared focus on advanced aerospace propulsion technologies.\n\nRelationship: The sentences appear to revolve around discussing the capabilities and potential advancements associated with the Dual-Mode Scramjet (DMSJ) engine in aerospace propulsion. Their proximity suggests a coherent exploration of this specific technology rather than being coincidental."
  },
  {
    "hex_coord": [
      -15,
      1
    ],
    "country": 1,
    "MSU_ids": [
      21,
      429
    ],
    "summary": "The sentences from the papers \"largeeddyMSU\" suggest a common theme of aerodynamics and combustion in engine design. They discuss the impact of engine characteristics like speed, weight, and range on vortex shedding in fuel jets, indicating a focus on propulsion systems' efficiency and performance."
  },
  {
    "hex_coord": [
      -8,
      3
    ],
    "country": 1,
    "MSU_ids": [
      25
    ],
    "summary": "The cluster of sentences discusses airflow conditions in the combustor at specific flight Mach numbers, particularly when Maᶠ = 3–6, highlighting the transition to subsonic airflow known as the ram mode. The theme revolves around aerodynamic properties at varying Mach numbers and their impact on the combustor airflow."
  },
  {
    "hex_coord": [
      -14,
      5
    ],
    "country": 1,
    "MSU_ids": [
      26,
      27,
      49,
      79,
      189
    ],
    "summary": "The cluster of sentences pertains to the fluid dynamics and combustion stability in scramjet engines. They collectively discuss the impact of various factors such as flow instabilities, flame-holder design, and wall resolution on the operational performance and efficiency of scramjets."
  },
  {
    "hex_coord": [
      -9,
      2
    ],
    "country": 1,
    "MSU_ids": [
      28
    ],
    "summary": "The cluster of sentences pertains to the preferred configuration of a combustor in scramjet engines, specifically highlighting the design comprising a cavity and rearwall expansion. These sentences collectively focus on the evolution and significance of this particular configuration within the context of scramjet engine development."
  },
  {
    "hex_coord": [
      -17,
      -3
    ],
    "country": 1,
    "MSU_ids": [
      30
    ],
    "summary": "**Summary:** The common theme across the sentences is a growing need for precise replication of flow fields under real-world engine conditions. This indicates a shared focus on enhancing accuracy in simulating engine operating environments."
  },
  {
    "hex_coord": [
      -16,
      -1
    ],
    "country": 1,
    "MSU_ids": [
      31
    ],
    "summary": "The sentence extracted from the paper \"Large Eddy Simulation of Mode Transition in Spark Ignition Engines\" discusses controlling mode transition in a direct-injection spark ignition engine by adjusting fuel injection regularity. The common theme among the sentences is likely related to the management of engine operations through fuel injection control."
  },
  {
    "hex_coord": [
      0,
      -1
    ],
    "country": 1,
    "MSU_ids": [
      41
    ],
    "summary": "The common theme among these sentences is the focused study on the mechanisms responsible for stabilizing combustion. They appear to discuss different aspects or approaches within this particular research area, reflecting a shared interest in understanding combustion stability mechanisms."
  },
  {
    "hex_coord": [
      -13,
      6
    ],
    "country": 1,
    "MSU_ids": [
      42
    ],
    "summary": "The sentences discuss different modes of flame stabilization in combustion, specifically focusing on three common stabilization modes: cavity shear-layer stabilized combustion, cavity assisted jet-wake stabilized combustion, and combined cavity shear-layer/recirculation stabilized combustion. These modes highlight distinct approaches to anchoring flames in combustion processes."
  },
  {
    "hex_coord": [
      -6,
      -3
    ],
    "country": 1,
    "MSU_ids": [
      46
    ],
    "summary": "This sentence suggests a common theme of research on scramjet investigations, focusing on various configurations and injection schemes. The relationship points to a shared emphasis on exploring different aspects of scramjet technologies within the field of aerospace engineering."
  },
  {
    "hex_coord": [
      -13,
      1
    ],
    "country": 1,
    "MSU_ids": [
      47
    ],
    "summary": "This sentence points to a common theme of research focus on stable flame representations in current publications, potentially related to combustion dynamics or fluid mechanics. The proximity of these sentences suggests they are discussing different facets of the same overarching topic rather than being coincidental."
  },
  {
    "hex_coord": [
      -3,
      3
    ],
    "country": 1,
    "MSU_ids": [
      48
    ],
    "summary": "The sentence extracted from the paper titled \"largeeddyMSU\" highlights the scarcity of research on dynamic processes related to unstable flames, including ignition dynamics, thermal-acoustic oscillation, flame flashback, and flow-induced unstable flames. This cluster likely centers around the challenges associated with studying and understanding unstable flame behavior in combustion systems."
  },
  {
    "hex_coord": [
      -8,
      2
    ],
    "country": 1,
    "MSU_ids": [
      57
    ],
    "summary": "The common theme across the sentences is the discussion of the complication of the instability process due to possible interactions with fuel jets. These sentences likely relate to the study of instability mechanisms in the context of large eddy simulations and fuel injection systems."
  },
  {
    "hex_coord": [
      -14,
      6
    ],
    "country": 1,
    "MSU_ids": [
      63
    ],
    "summary": "The sentence provided discusses the phenomenon of flow separation during the transition of combustion modes, likely within the context of a study on Large Eddy Simulation (LES) methodology. The common theme revolves around examining the fluid dynamics and combustion behavior during these mode transitions."
  },
  {
    "hex_coord": [
      -11,
      4
    ],
    "country": 1,
    "MSU_ids": [
      64
    ],
    "summary": "The sentences appear to revolve around the topic of combustion instabilities, specifically focusing on the heightened intensity and severity observed during mode transition. The proximity of these sentences indicates a coherent exploration of this specific issue in combustion dynamics."
  },
  {
    "hex_coord": [
      -12,
      6
    ],
    "country": 1,
    "MSU_ids": [
      65,
      286
    ],
    "summary": "**Summary:**\nThe extracted sentences from the paper \"largeeddyMSU\" focus on the topic of combustion instabilities and flame regimes. The common theme centers around understanding the factors contributing to combustion instabilities and utilizing metrics like the Takeno Flame Index to characterize flame regimes. These topics are closely related, discussing different aspects of the same problem in combustion studies."
  },
  {
    "hex_coord": [
      -2,
      -3
    ],
    "country": 1,
    "MSU_ids": [
      77
    ],
    "summary": "The cluster of sentences focuses on the inherent instability of the combustion flow field in a scramjet engine. The common theme revolves around understanding and potentially mitigating this instability for improved engine performance and reliability.\n\nRelationship: The sentence highlights a specific aspect of scramjet engines, suggesting a common focus on studying and addressing the challenges associated with the combustion flow field instability within this context. The relatedness is specific and not merely coincidental."
  },
  {
    "hex_coord": [
      -3,
      1
    ],
    "country": 1,
    "MSU_ids": [
      78
    ],
    "summary": "The sentence: \"The combustion flow field in a scramjet is characterized by the presence of temporal oscillations.\" is likely related to research on flow dynamics and combustion instability in scramjet engines. This suggests a common theme of studying the impact of temporal oscillations on the combustion process in scramjets."
  },
  {
    "hex_coord": [
      -6,
      4
    ],
    "country": 1,
    "MSU_ids": [
      80
    ],
    "summary": "The common theme across the sentences is the lack of sufficient attention given to separation-driven supersonic combustion instability. The sentences highlight this specific problem within the context of combustion instability, implying a shared focus on this particular issue."
  },
  {
    "hex_coord": [
      -16,
      1
    ],
    "country": 1,
    "MSU_ids": [
      83
    ],
    "summary": "The common theme among the sentences is the application of large-eddy simulation (LES) in predicting time-varying phenomena. The relationship indicates a focused discussion on the capabilities and potential of LES in capturing dynamic processes accurately."
  },
  {
    "hex_coord": [
      -6,
      -12
    ],
    "country": 1,
    "MSU_ids": [
      107
    ],
    "summary": "Based on the provided sentence, it appears to discuss a specific proposal for an eddy-viscosity model by Yoshizawa et al. This cluster seems to focus on turbulence modeling in fluid dynamics, particularly the development of one-equation models."
  },
  {
    "hex_coord": [
      -8,
      -9
    ],
    "country": 1,
    "MSU_ids": [
      108
    ],
    "summary": "Based on the extracted sentence about the one-equation eddy-viscosity model articulating the transportation process of subgrid-scale turbulence kinetic energy, the common theme among the papers likely pertains to turbulence modeling or subgrid-scale modeling in computational fluid dynamics. These sentences seem to focus on a specific aspect within the broader domain of fluid dynamics modeling."
  },
  {
    "hex_coord": [
      5,
      -14
    ],
    "country": 1,
    "MSU_ids": [
      109
    ],
    "summary": "The sentence provided pertains to the purpose of a model in closing unresolved terms resulting from a filtering process. This suggests a common theme related to computational modeling and potentially pertains to addressing ambiguities in computational simulations."
  },
  {
    "hex_coord": [
      -1,
      -8
    ],
    "country": 1,
    "MSU_ids": [
      110
    ],
    "summary": "The sentence provided relates to the calculation of production, dissipation, and diffusion of ksgs in the context of a large eddy simulation model. The common theme appears to be the analysis of turbulent kinetic energy dynamics within this particular simulation framework, indicating a focused exploration of fluid dynamics in turbulent flows."
  },
  {
    "hex_coord": [
      -2,
      -10
    ],
    "country": 1,
    "MSU_ids": [
      115
    ],
    "summary": "The provided sentence discusses the potential of addressing energy backscatter to match the local structures of actual turbulence, as per the findings in the work by Kim et al. This indicates a focus on turbulence modeling and energy dissipation strategies within the field of fluid dynamics."
  },
  {
    "hex_coord": [
      -12,
      -10
    ],
    "country": 1,
    "MSU_ids": [
      116
    ],
    "summary": "These scattered sentences point towards the common theme of improving the accuracy of large eddy simulations near stationary walls by dynamically selecting model coefficients based on local solvable scales, as discussed in the study by Kim et al. The sentences are likely related, focusing on a specific method or approach within the context of fluid dynamics simulations."
  },
  {
    "hex_coord": [
      -11,
      -8
    ],
    "country": 1,
    "MSU_ids": [
      118
    ],
    "summary": "The identified sentences revolve around the significance of turbulent scalar fluxes, specifically *Hsgs <sup>j</sup>* and *<sup>ϒ</sup>sgs <sup>j</sup>,<sup>k</sup>*, as crucial unclosed terms in filtered Large Eddy Simulation (LES) equations. This indicates a shared focus on turbulence modeling and scalar transport in LES computations."
  },
  {
    "hex_coord": [
      3,
      -11
    ],
    "country": 1,
    "MSU_ids": [
      126
    ],
    "summary": "The sentence provided suggests a focus on the justification of a mechanism in supersonic combustion, likely within the context of Large Eddy Simulations (LES).\n\nRelationship: The sentence indicates a specific focus on the justification of a mechanism in supersonic combustion within the realm of large eddy simulations, implying a direct relationship rather than a broad similarity."
  },
  {
    "hex_coord": [
      0,
      1
    ],
    "country": 1,
    "MSU_ids": [
      129
    ],
    "summary": "The extracted sentence mentions the total molar concentration in a context related to \"largeeddyMSU,\" which likely points to a specific research methodology or computational approach used in a scientific study. The theme seems to revolve around quantifying molar concentrations within this framework.\n\nRelationship: The sentence appears to discuss a technical detail within the domain of large-eddy simulations or computational modeling. This focus suggests that the items in the cluster are related to the specific application or methodology of \"largeeddyMSU\" rather than broader themes."
  },
  {
    "hex_coord": [
      -3,
      4
    ],
    "country": 1,
    "MSU_ids": [
      130
    ],
    "summary": "The sentence likely pertains to discussing the stoichiometric coefficients and forward reaction rates in the context of a specific reaction or chemical process. This isolated sentence does not strongly suggest a specific, unified focus with the provided paper title \"largeeddyMSU.\""
  },
  {
    "hex_coord": [
      -10,
      -13
    ],
    "country": 1,
    "MSU_ids": [
      131
    ],
    "summary": "Based on the provided information, the common theme appears to revolve around turbulence modeling, specifically focusing on the relationship between the subgrid scale and the Kolmogorov scale in large eddy simulations. These sentences likely discuss different aspects of turbulence analysis within this context and are not isolated coincidences."
  },
  {
    "hex_coord": [
      -17,
      3
    ],
    "country": 1,
    "MSU_ids": [
      141
    ],
    "summary": "The paper discusses enhancements made to the HLLC-P Riemann solver to address distortion and instability problems in low Mach number flows. The common theme across the sentence is the refinement of computational fluid dynamics solvers for improved accuracy and stability in specific flow regimes. These sentences are related in terms of advancing numerical methods for fluid dynamics simulations."
  },
  {
    "hex_coord": [
      -16,
      5
    ],
    "country": 1,
    "MSU_ids": [
      142,
      322
    ],
    "summary": "The common theme in these sentences is the discussion of flow regimes in varying conditions, emphasizing the importance of understanding them for mode transition analysis. They are related in that they both address the significance of analyzing flow regimes across different speed regimes but represent different perspectives on the topic."
  },
  {
    "hex_coord": [
      3,
      -13
    ],
    "country": 1,
    "MSU_ids": [
      154
    ],
    "summary": "Based on the provided sentence, it appears to reference a research facility where experimental studies have been conducted, suggesting a common theme around experimental studies in scientific literature. The sentences seem to share a connection in the context of experimental research conducted at a particular facility."
  },
  {
    "hex_coord": [
      -16,
      -5
    ],
    "country": 1,
    "MSU_ids": [
      156
    ],
    "summary": "These sentences do not share a specific, unified focus. They appear to be unrelated, and their proximity may be coincidental."
  },
  {
    "hex_coord": [
      -11,
      0
    ],
    "country": 1,
    "MSU_ids": [
      157
    ],
    "summary": "Based on the provided sentence, it appears to be an isolated technical detail related to the length of a geometry within a Large-Eddy Simulation (LES) framework. This sentence does not suggest a specific, unified focus with other papers or form a larger thematic connection."
  },
  {
    "hex_coord": [
      -16,
      3
    ],
    "country": 1,
    "MSU_ids": [
      158
    ],
    "summary": "This cluster of sentences seems to focus on the technical description of an isolator within a research context, likely related to fluid mechanics or engineering. The sentences are closely related in discussing the specific dimensions and sections of the isolator, suggesting a common theme of detailed design analysis rather than a broader topic."
  },
  {
    "hex_coord": [
      -13,
      3
    ],
    "country": 1,
    "MSU_ids": [
      159
    ],
    "summary": "The extracted sentence refers to the isolator's divergent angle of α = 1.4°. This data seems to belong to a detailed technical or engineering study related to the design or performance of an isolator, possibly in the context of fluid dynamics or aerodynamics."
  },
  {
    "hex_coord": [
      -15,
      -7
    ],
    "country": 1,
    "MSU_ids": [
      160
    ],
    "summary": "Based on the provided information from the paper titled \"largeeddyMSU,\" the extracted sentence indicates a focus on defining the computational domain within a channel for research or simulation purposes, suggesting a concentration on computational fluid dynamics or numerical simulations within a specific spatial framework."
  },
  {
    "hex_coord": [
      -9,
      -1
    ],
    "country": 1,
    "MSU_ids": [
      161
    ],
    "summary": "Based on the provided sentence, which alludes to mapping a section to an air inlet for velocity profile in a large eddy simulation, the common theme appears to be computational fluid dynamics or flow analysis in engineering simulations. The relationship among the sentences seems to focus on specific techniques or processes within this field."
  },
  {
    "hex_coord": [
      -16,
      4
    ],
    "country": 1,
    "MSU_ids": [
      163,
      230
    ],
    "summary": "The cluster of sentences suggests a common focus on the characterization of flow properties in large-eddy simulation (LES) related to pressure-rise points and entry height within isolators, indicating a shared theme of evaluating aerodynamic phenomena in confined spaces. These findings are likely discussing different aspects of aerodynamic analysis in LES models."
  },
  {
    "hex_coord": [
      -12,
      1
    ],
    "country": 1,
    "MSU_ids": [
      190
    ],
    "summary": "The sentence provided seems to be related to applying a dynamic turbulence model in large eddy simulation (LES), particularly mentioning the suitability of a specific y+ value of 10 in such cases. This cluster's common theme revolves around turbulence modeling and its application in LES, indicating a focused discussion on turbulence modeling practices within the context of large eddy simulation."
  },
  {
    "hex_coord": [
      8,
      -8
    ],
    "country": 1,
    "MSU_ids": [
      204
    ],
    "summary": "Based on the provided sentence, it appears that the common theme across the papers involves the consistency of results in relation to investigations conducted, possibly in the context of Large Eddy Simulation (LES) or a similar domain. The relationship between the sentences seems tenuous and may reflect a general agreement or alignment in findings rather than a deep thematic connection."
  },
  {
    "hex_coord": [
      -2,
      5
    ],
    "country": 1,
    "MSU_ids": [
      215
    ],
    "summary": "The single sentence provided, \"γ = 1.4 is the specific heat ratio,\" likely relates to a discussion on the specific heat ratio γ in a study on a topic related to large eddy simulations. This sentence itself does not provide detailed context to determine a specific common theme beyond this technical point."
  },
  {
    "hex_coord": [
      -2,
      -14
    ],
    "country": 1,
    "MSU_ids": [
      216
    ],
    "summary": "The sentence provided does not offer sufficient information to discern a common theme or relationship among the academic papers. The sentence appears to relate to a mathematical or engineering concept regarding the cross-sectional area of a channel, potentially in the context of fluid mechanics or a similar field. The cluster lacks a clear, specific focus."
  },
  {
    "hex_coord": [
      -7,
      -2
    ],
    "country": 1,
    "MSU_ids": [
      217
    ],
    "summary": "This cluster of sentences does not indicate a specific, unified focus. The sentence provided seems to be a technical detail related to fluid mechanics or aerodynamics, but without additional context or related sentences, the common theme or broader topic remains unclear."
  },
  {
    "hex_coord": [
      -13,
      4
    ],
    "country": 1,
    "MSU_ids": [
      218
    ],
    "summary": "The sentence refers to defining the hydraulic diameter in the context of fluid mechanics, specifically related to the wetted perimeter of a flow channel. This cluster appears to focus on the concept of hydraulic diameter in fluid dynamics and its calculation based on the wetted perimeter."
  },
  {
    "hex_coord": [
      -7,
      4
    ],
    "country": 1,
    "MSU_ids": [
      229
    ],
    "summary": "The sentence suggests a common theme of identifying the operating mode of the DMSJ engine. However, without further context from the papers, the relationship among them cannot be determined conclusively."
  },
  {
    "hex_coord": [
      -12,
      -3
    ],
    "country": 1,
    "MSU_ids": [
      231
    ],
    "summary": "Based on the provided sentence and paper title \"largeeddyMSU,\" it appears that the common theme is the categorization of approaches based on the size of the separation zone in a particular context. The relationship among these sentences seems to focus on discussing different strategies or methods related to the separation zone's size within the scope of the given paper."
  },
  {
    "hex_coord": [
      -9,
      4
    ],
    "country": 1,
    "MSU_ids": [
      232
    ],
    "summary": "Based on the extracted sentence referring to categorization by Mach number at the isolator exit, the common theme among the papers appears to involve the classification or differentiation of approaches based on this specific parameter in the context of large eddy simulations. The relationship seems to revolve around discussing various categorization methods within this domain."
  },
  {
    "hex_coord": [
      -11,
      2
    ],
    "country": 1,
    "MSU_ids": [
      275
    ],
    "summary": "These sentences collectively address the topic of combustion stabilization mechanisms in a cavity-floor direct-injection scramjet. They are likely discussing different aspects or findings related to this specific propulsion system, indicating a coherent focus on combustion processes within this context."
  },
  {
    "hex_coord": [
      -15,
      -2
    ],
    "country": 1,
    "MSU_ids": [
      285,
      307
    ],
    "summary": "The two sentences extracted from the paper \"largeeddyMSU\" focus on the calculation and behavior of the Takeno Flame Index (TFI) and the entrainment of a downstream-developing rich mixture by counter-rotating streamwise vortex-pairs. The common theme is the analysis of combustion processes involving fluid dynamics and vortex interactions in combustion systems."
  },
  {
    "hex_coord": [
      -10,
      -7
    ],
    "country": 1,
    "MSU_ids": [
      287
    ],
    "summary": "The extracted sentence refers to a parameter (TFI = -1) denoting the diffusion regime in a paper titled \"largeeddyMSU.\" This suggests a specific focus on diffusion regimes in the context of the mentioned paper. The relationship with other sentences cannot be definitively established based on the provided isolated sentence."
  },
  {
    "hex_coord": [
      -6,
      -4
    ],
    "country": 1,
    "MSU_ids": [
      288
    ],
    "summary": "While the input consists of just one sentence extracted from a paper titled \"largeeddyMSU,\" it appears to center around the concept of TFI = 1 denoting the premixed regime. This single sentence doesn't provide enough context to conclusively determine a common theme or relational pattern with other papers."
  },
  {
    "hex_coord": [
      -15,
      6
    ],
    "country": 1,
    "MSU_ids": [
      289
    ],
    "summary": "The sentence retrieved from the paper \"largeeddyMSU\" discusses the identification of the fuel-rich condition in the local premixed regime using the mixture fraction Z. The common theme among these sentences appears to be the characterization or identification of combustion regimes based on specific parameters such as mixture fraction. The relationship between the sentences indicates a focus on fuel-rich conditions within the context of combustion regimes."
  },
  {
    "hex_coord": [
      -9,
      1
    ],
    "country": 1,
    "MSU_ids": [
      302
    ],
    "summary": "Based on the provided sentence mentioning the \"flame stabilization mechanism in the cavity-floor direct-injection scramjet,\" the common theme appears to revolve around the aerodynamics and combustion processes involved in scramjet propulsion systems. These sentences likely discuss different aspects or features of this specific type of propulsion system, indicating a focused exploration rather than a broad subject."
  },
  {
    "hex_coord": [
      1,
      -11
    ],
    "country": 1,
    "MSU_ids": [
      308
    ],
    "summary": "The sentence extracted from the paper \"largeeddyMSU\" mentions the observation of entrainment by counter-rotating streamwise vortex-pairs in the research by Liu. This cluster likely revolves around the study or phenomenon of entrainment by counter-rotating streamwise vortex-pairs, suggesting a shared focus."
  },
  {
    "hex_coord": [
      3,
      -15
    ],
    "country": 1,
    "MSU_ids": [
      326
    ],
    "summary": "The sentence extracted from the paper \"largeeddyMSU\" mentions being inspired by the work of Cao et al. This suggests a connection between the approaches or methodologies discussed in these papers, indicating a potential relationship in terms of research inspiration or methodology adoption."
  },
  {
    "hex_coord": [
      -13,
      -1
    ],
    "country": 1,
    "MSU_ids": [
      328
    ],
    "summary": "The cluster centers around the differentiation of subsonic downstream and upstream regimes, as denoted by the subscripts in Equation (15). There seems to be a specific focus on discussing the characteristics or implications of these regimes within the context of the paper."
  },
  {
    "hex_coord": [
      -11,
      3
    ],
    "country": 1,
    "MSU_ids": [
      337
    ],
    "summary": "The cluster of sentences suggests a common focus on analyzing the dynamic behaviors of shock waves and flames during scram-to-ram transition in the context of large eddy simulations. It is likely that these sentences discuss different aspects of this specific phenomenon rather than being coincidental proximity."
  },
  {
    "hex_coord": [
      -1,
      4
    ],
    "country": 1,
    "MSU_ids": [
      363
    ],
    "summary": "The sentences provided mention an oscillation phenomenon between two combustion modes observed in Nakaya's studies, suggesting a common theme of combustion mode transitions in large-eddy simulations. These findings likely share a specific, unified focus on the dynamics of combustion mode shifts."
  },
  {
    "hex_coord": [
      -12,
      4
    ],
    "country": 1,
    "MSU_ids": [
      364
    ],
    "summary": "Based on the provided sentence, it suggests a common theme related to fluid dynamics and combustion processes in the context of large eddy simulations. The relationship appears to revolve around the interaction between vortex structures from separated boundary layers and their effects on flame dynamics, pointing towards a specific focus on flow-mediated combustion phenomena."
  },
  {
    "hex_coord": [
      -10,
      5
    ],
    "country": 1,
    "MSU_ids": [
      365
    ],
    "summary": "Based on the given information, the common theme among the papers appears to be combustion dynamics in the context of jet-wake flames. The discussed concept involves transient thermal choking, shear layer stabilization, and ram combustion dynamics. The sentences share a specific focus on these aspects, suggesting a related theme within the cluster."
  },
  {
    "hex_coord": [
      -7,
      5
    ],
    "country": 1,
    "MSU_ids": [
      446
    ],
    "summary": "The sentence points towards a discussion on the comparison of frequencies related to Partially-Observed Markov Chains (POMs) and flame oscillation modes. This implies a shared focus on investigating frequency characteristics in the contexts of POMs and flame dynamics.\n\nRelationship: The sentences are likely discussing different facets of frequency analysis within the realms of complex systems, indicating a common interest in examining oscillation patterns in diverse settings rather than a coincidental proximity."
  },
  {
    "hex_coord": [
      -4,
      2
    ],
    "country": 1,
    "MSU_ids": [
      465
    ],
    "summary": "The sentence extracted from the paper titled \"Large Eddy Simulation Study of Unsteady Flame Structures in a Model Gas Turbine Combustor\" discusses flame structures corresponding to different operating modes within a gas turbine combustor. The common theme across the sentences seems to be focused on flame dynamics in combustion systems, particularly in the context of scram and ram operating modes.\n\nRelationship: The sentences are likely discussing different flame structures and their characteristics or behaviors in specific operational settings within gas turbine combustors. The proximity of the sentences suggests a shared focus on understanding the dynamics and features of flames under different operating conditions in this specific engineering context."
  },
  {
    "hex_coord": [
      -10,
      1
    ],
    "country": 1,
    "MSU_ids": [
      476
    ],
    "summary": "The sentence extracted from the paper \"largeeddyMSU\" discusses the Scram-to-ram mode transition based on flame behavior in three distinct stages, indicating a focus on combustion dynamics and transitions within that specific context. The relationship to other sentences is likely coincidental."
  },
  {
    "hex_coord": [
      -1,
      -5
    ],
    "country": 1,
    "MSU_ids": [
      483
    ],
    "summary": "Based on the provided sentence, it suggests a common theme centered around the need for research focused on practical engine configurations and operational circumstances. This cluster appears to discuss a specific area related to engine design and operation, hinting at a shared interest in advancing technologies in this domain."
  },
  {
    "hex_coord": [
      -3,
      -5
    ],
    "country": 1,
    "MSU_ids": [
      484
    ],
    "summary": "The extracted sentence from the paper \"largeeddyMSU\" emphasizes the importance of studying passive-injection schemes for future endeavors in the context of the research domain. This singular sentence does not provide enough context to identify a specific common theme or relation with other papers."
  },
  {
    "hex_coord": [
      3,
      -4
    ],
    "country": 1,
    "MSU_ids": [
      485
    ],
    "summary": "The identified sentence hints at research focused on investigating the utilization of ethylene fuel, likely within an academic context. This suggests a common theme of exploring the potential applications and implications of using ethylene as a fuel source. The relationship among the sentences is likely coincidental unless additional context reveals a more substantial connection."
  },
  {
    "hex_coord": [
      -2,
      -7
    ],
    "country": 1,
    "MSU_ids": [
      486
    ],
    "summary": "These sentences suggest a common theme of investigating the ram-to-scram transition process, likely related to aerodynamics or propulsion systems research. While the details may vary, the focus remains on understanding and potentially optimizing this transition."
  },
  {
    "hex_coord": [
      8,
      -8
    ],
    "country": 2,
    "MSU_ids": [
      489
    ],
    "summary": "Based on the provided sentence, the common theme appears to be the visualization interface of a visual analytics system called TemporalFlowViz. The relationship between the sentences seems to be specific, focusing on illustrating the interface rather than discussing broader topics or facets."
  },
  {
    "hex_coord": [
      0,
      -4
    ],
    "country": 2,
    "MSU_ids": [
      495
    ],
    "summary": "The sentence provided, extracted from a paper titled \"temporalvisMSU,\" highlights the importance of comprehending the intricate combustion dynamics in scramjet engines for the progress of high-speed propulsion technologies. The common theme revolves around the significance of understanding combustion dynamics in scramjet engines for advancements in high-speed propulsion technologies."
  },
  {
    "hex_coord": [
      -11,
      -4
    ],
    "country": 2,
    "MSU_ids": [
      496
    ],
    "summary": "The sentence revolves around the challenges posed by the large scale and high dimensionality of simulation-generated temporal flow field data, emphasizing the difficulty in visually interpreting such complex data. The common theme is the visualization challenges associated with handling extensive and multidimensional temporal flow field data in simulations."
  },
  {
    "hex_coord": [
      -18,
      1
    ],
    "country": 2,
    "MSU_ids": [
      497,
      529
    ],
    "summary": "The identified sentences from the papers on temporal visualization highlight the challenges posed by the large scale and high dimensionality of simulation-generated temporal flow field data, emphasizing the limitations of existing metrics in understanding the underlying spatial and temporal structures in reactive flows. The common theme revolves around the complexities of analyzing and visualizing temporal data, pointing towards the need for improved techniques and metrics for capturing the intricate dynamics within these datasets. The relationship between these sentences suggests a shared focus on the obstacles and current limitations in effectively interpreting temporal flow field data."
  },
  {
    "hex_coord": [
      -17,
      0
    ],
    "country": 2,
    "MSU_ids": [
      498
    ],
    "summary": "The common theme among the extracted sentences is the analysis of challenges posed by the large scale and high dimensionality of simulation-generated temporal flow field data, particularly focusing on difficulties related to cross-case comparison. These sentences are closely related, indicating a specific focus on the complexities of handling such data in research."
  },
  {
    "hex_coord": [
      9,
      -5
    ],
    "country": 2,
    "MSU_ids": [
      517
    ],
    "summary": "Based on the provided sentence \"The study is related to Visual Analytics\", it appears that the common theme across the papers is Visual Analytics. The relationship among these papers is likely focused on different aspects or applications of Visual Analytics."
  },
  {
    "hex_coord": [
      -8,
      -10
    ],
    "country": 2,
    "MSU_ids": [
      518
    ],
    "summary": "Based on the provided sentence \"The study involves Temporal Flow Field,\" it appears that the common theme across the papers is related to temporal visualization or analysis of flow fields. The sentences likely share a specific focus on this topic or related concepts within temporal flow field analysis."
  },
  {
    "hex_coord": [
      6,
      -7
    ],
    "country": 2,
    "MSU_ids": [
      519
    ],
    "summary": "Based on the provided information, it appears that the common theme across the sentences is the study of Scientific Data Simulation. The relationship among them suggests a focus on this specific topic, indicating a coherent and related cluster pointing towards exploring issues related to the simulation of scientific data."
  },
  {
    "hex_coord": [
      -2,
      -5
    ],
    "country": 2,
    "MSU_ids": [
      521
    ],
    "summary": "Based on the sentence provided, the common theme appears to be the significance of supersonic combustion in scramjet engines for achieving sustained hypersonic flight. All sentences seem to revolve around this central idea, suggesting a coherent focus on the importance of this technological aspect."
  },
  {
    "hex_coord": [
      -2,
      -2
    ],
    "country": 2,
    "MSU_ids": [
      522,
      909
    ],
    "summary": "The sentences extracted from the papers titled \"temporalvisMSU\" focus on the significance of computational simulations in analyzing interactions within high-speed propulsion systems, specifically emphasizing turbulence, chemical kinetics, and thermal effects, as well as the importance of considering the geometric configuration of scramjet engines. These sentences highlight the common theme of utilizing computational simulations for studying complex phenomena in propulsion systems."
  },
  {
    "hex_coord": [
      -15,
      -3
    ],
    "country": 2,
    "MSU_ids": [
      523
    ],
    "summary": "This sentence discusses the challenge posed by high-resolution, time-sequenced flow field image data that is both massive and high-dimensional in scale. The common theme across the papers seems to be the complexity and scale of data in a temporal visualization context. The relationship among the sentences appears to focus on the computational challenges associated with analyzing such data rather than discussing different facets of a larger topic."
  },
  {
    "hex_coord": [
      -2,
      -6
    ],
    "country": 2,
    "MSU_ids": [
      524
    ],
    "summary": "Based on the provided sentence, it appears that the common theme revolves around the challenges associated with analyzing and interpreting massive, high-dimensional temporal data. These challenges likely relate to complexities in data processing and insights extraction, indicating a shared focus on the difficulty of handling such data sets."
  },
  {
    "hex_coord": [
      -13,
      4
    ],
    "country": 2,
    "MSU_ids": [
      525,
      646
    ],
    "summary": "The theme connecting the sentences from the papers \"temporalvisMSU\" seems to focus on combustion performance assessment and the influence of water vapor content on mixture equivalence ratio. These sentences are likely discussing different aspects of the combustion process, specifically related to evaluating performance metrics and understanding the impact of water vapor in combustion."
  },
  {
    "hex_coord": [
      -15,
      3
    ],
    "country": 2,
    "MSU_ids": [
      526,
      616
    ],
    "summary": "The common theme across the sentences from the papers \"temporalvisMSU\" appears to be combustion analysis with a focus on scalar metrics and the impact of initial condition parameters on combustion outcomes. These sentences likely relate to different aspects of combustion analysis rather than being entirely separate topics."
  },
  {
    "hex_coord": [
      -16,
      4
    ],
    "country": 2,
    "MSU_ids": [
      527,
      633
    ],
    "summary": "The sentences from the papers \"temporalvisMSU\" indicate a focus on computational fluid dynamics (CFD) related to high-speed reactive flow modeling, specifically mentioning scalar metrics and pressure rise. These sentences are likely discussing different aspects of CFD modeling, showing a specific but broad focus on fluid dynamics analysis in high-speed environments."
  },
  {
    "hex_coord": [
      -14,
      0
    ],
    "country": 2,
    "MSU_ids": [
      528
    ],
    "summary": "These sentences do not show a strong, specific, or unified focus. They appear to be isolated and not directly related to each other in a coherent manner."
  },
  {
    "hex_coord": [
      -12,
      4
    ],
    "country": 2,
    "MSU_ids": [
      530
    ],
    "summary": "The common theme across the papers appears to be the investigation of the impact of initial conditions on combustion dynamics, reflecting a shared focus on exploring this relationship in depth. These sentences suggest a coherent thread of research into the influence of starting conditions on combustion behavior."
  },
  {
    "hex_coord": [
      3,
      -6
    ],
    "country": 2,
    "MSU_ids": [
      531
    ],
    "summary": "These sentences focus on the need for tools that enable exploratory and interpretable analysis of large-scale simulation data. The common theme revolves around addressing the increasing demand for methods facilitating human-in-the-loop analysis in the context of temporal visualization."
  },
  {
    "hex_coord": [
      -8,
      -13
    ],
    "country": 2,
    "MSU_ids": [
      532
    ],
    "summary": "Based on the provided information, the sentence \"Recent advances in deep learning offer promising solutions\" hints at a common theme of advancements in deep learning. The relationship among the sentences appears to focus on discussing the advancements and potential solutions within the realm of deep learning."
  },
  {
    "hex_coord": [
      -14,
      -5
    ],
    "country": 2,
    "MSU_ids": [
      540
    ],
    "summary": "These sentences do not share a specific, unified focus."
  },
  {
    "hex_coord": [
      -18,
      2
    ],
    "country": 2,
    "MSU_ids": [
      541,
      641
    ],
    "summary": "The sentences from the papers titled \"temporalvisMSU\" suggest a common theme of expert interpretation of flow behavior, focusing on factors like flame fronts, shock structures, pressure gradients, and how static pressure influences upstream compression and shock strength. These discussions revolve around understanding flow dynamics and its key determinants."
  },
  {
    "hex_coord": [
      -15,
      -1
    ],
    "country": 2,
    "MSU_ids": [
      542
    ],
    "summary": "The sentences suggest a common theme of investigating the inadequacy of conventional embedding pipelines in automatically encoding or explaining phenomena like flame fronts, shock structures, and pressure gradients, particularly in the context of temporal visualization.\n\nRelationship: The sentences appear to be discussing different aspects or challenges related to the representation and understanding of complex physical phenomena in temporal visualization, indicating a focused exploration rather than a coincidence."
  },
  {
    "hex_coord": [
      -9,
      -13
    ],
    "country": 2,
    "MSU_ids": [
      543,
      570
    ],
    "summary": "Based on the provided sentences from the papers \"temporalvisMSU,\" the common theme revolves around advancements in vision-language models (VLMs) and the usage of methods like stacked denoising autoencoders for learning compact representations from visual inputs. These sentences are likely discussing different facets of the broader topic of visual information processing and representation learning."
  },
  {
    "hex_coord": [
      -2,
      -10
    ],
    "country": 2,
    "MSU_ids": [
      544
    ],
    "summary": "The common theme across the papers appears to be the limited application of vision-language models (VLMs) in the field of scientific visualization. These sentences likely relate to different aspects or challenges within this specific research domain rather than random proximity."
  },
  {
    "hex_coord": [
      -1,
      -8
    ],
    "country": 2,
    "MSU_ids": [
      545
    ],
    "summary": "The shared theme among the sentences is the use of Vector Language Models (VLMs) in scientific visualization, especially in domains requiring precise interpretation of domain-specific terms. The sentences likely discuss different aspects or challenges related to this specialized application of VLMs."
  },
  {
    "hex_coord": [
      -5,
      -5
    ],
    "country": 2,
    "MSU_ids": [
      555
    ],
    "summary": "The sentence refers to the evolution of visualization techniques in addressing challenges related to interpreting complex, high-dimensional fluid dynamics data. The common theme across the sentences is the advancement of visualization methods specifically for flow field analysis in fluid dynamics. These sentences likely discuss different aspects of the same topic or concept, focusing on the visualization challenges in this particular domain."
  },
  {
    "hex_coord": [
      5,
      -12
    ],
    "country": 2,
    "MSU_ids": [
      556
    ],
    "summary": "Based on the provided sentence, the common theme appears to be the customization of flow visualization techniques for educational purposes in specific domains. The relationship among the sentences seems to revolve around discussing domain-specific applications and tailored visualization approaches, suggesting a shared focus on adapting visualization methods for educational contexts."
  },
  {
    "hex_coord": [
      -3,
      3
    ],
    "country": 2,
    "MSU_ids": [
      558,
      699
    ],
    "summary": "The cluster of sentences focuses on visualization methods for studying thermophysical flow fields, particularly in the context of key combustion phenomena near isolator and cavity zones in scramjet geometry. These sentences share a common theme of applying visualization techniques to analyze complex flow dynamics in aerospace engineering."
  },
  {
    "hex_coord": [
      2,
      -7
    ],
    "country": 2,
    "MSU_ids": [
      564
    ],
    "summary": "The sentence highlights the importance of effective image representation in visual analytics systems for tasks like clustering and semantic interpretation. This indicates a focus on enhancing image analysis through better representations for improved data understanding and processing efficiency."
  },
  {
    "hex_coord": [
      -10,
      -8
    ],
    "country": 2,
    "MSU_ids": [
      565
    ],
    "summary": "The extracted sentence highlights the use of early handcrafted methods like SIFT for extracting local keypoint descriptors to capture distinctive image patches invariant to scale and rotation. The common theme centers around the application of handcrafted methods in computer vision, specifically focused on keypoint descriptor extraction. The relationship among the sentences is likely a discussion of different approaches or techniques within computer vision rather than a coincidence."
  },
  {
    "hex_coord": [
      -15,
      -6
    ],
    "country": 2,
    "MSU_ids": [
      566
    ],
    "summary": "The common theme across the sentences is the utilization of Histogram of Oriented Gradients (HOG) for encoding gradient orientations within localized cells to enhance object recognition in computer vision tasks. The sentences likely discuss different aspects or applications of HOG within the domain of visual recognition.\n\nRelationship:\nThe sentences share a focus on the application of Histogram of Oriented Gradients (HOG) for object recognition, suggesting a coherent discussion within the broader topic of computer vision. Their proximity is not coincidental but rather indicative of different perspectives on utilizing HOG for similar purposes."
  },
  {
    "hex_coord": [
      -18,
      -2
    ],
    "country": 2,
    "MSU_ids": [
      567
    ],
    "summary": "Based on the provided sentence, \"The advent of deep convolutional neural networks marked a paradigm shift,\" the common theme appears to be the revolutionary impact of deep convolutional neural networks. This suggests a focus on advancements in deep learning models and their transformative influence in the field."
  },
  {
    "hex_coord": [
      -16,
      -5
    ],
    "country": 2,
    "MSU_ids": [
      568
    ],
    "summary": "These sentences discuss the significance of AlexNet in demonstrating the effectiveness of end-to-end learning for achieving high performance in large-scale image classification tasks. The common theme revolves around the success of hierarchical feature learning in the context of image classification."
  },
  {
    "hex_coord": [
      -17,
      -2
    ],
    "country": 2,
    "MSU_ids": [
      569
    ],
    "summary": "The sentence extracted from the paper \"temporalvisMSU\" discusses how ResNet incorporates residual connections to enhance the training of extremely deep neural networks. The common theme centers around the application of residual connections in deep architecture design to address training challenges efficiently. These sentences likely share a focused discussion on the design and effectiveness of residual connections in deep learning models."
  },
  {
    "hex_coord": [
      -10,
      -10
    ],
    "country": 2,
    "MSU_ids": [
      571
    ],
    "summary": "The sentence from the paper \"temporalvisMSU\" states that stacked denoising autoencoders have been effective in clustering and anomaly detection. The common theme across the papers seems to revolve around the successful application of stacked denoising autoencoders in clustering and anomaly detection tasks."
  },
  {
    "hex_coord": [
      -11,
      -11
    ],
    "country": 2,
    "MSU_ids": [
      572
    ],
    "summary": "The sentence provided discusses how Vision Transformers, a type of neural network architecture, represent images as sequences of patch embeddings for improved long-range dependency capture. The common theme across the papers is likely related to the application or advancement of computer vision techniques, particularly focusing on Vision Transformers."
  },
  {
    "hex_coord": [
      -14,
      -6
    ],
    "country": 2,
    "MSU_ids": [
      573
    ],
    "summary": "The sentence provided, \"Vision Transformers achieve state-of-the-art results on various benchmarks,\" points to the common theme of advancements in Vision Transformers technology. This suggests a focus on the state-of-the-art performance of Vision Transformers across different benchmark tests in the field of computer vision. The relationship among the sentences in this cluster appears to be discussing the success and effectiveness of Vision Transformers in achieving top performance levels on diverse benchmarks, indicating a unified focus on the capabilities and achievements of Vision Transformers in the context of machine learning and computer vision research, rather than discussing different facets of a broader topic."
  },
  {
    "hex_coord": [
      3,
      -8
    ],
    "country": 2,
    "MSU_ids": [
      574
    ],
    "summary": "Theme The clustered sentence highlights the utilization of advanced methods for visualizing and analyzing complex flow-field imagery in the context of scramjet combustion analysis.\n\nRelationship: The sentence appears to be discussing a specific application area within the broader domain of visualization techniques for analyzing flow-field imagery, indicating a focused discussion rather than a coincidence."
  },
  {
    "hex_coord": [
      2,
      -11
    ],
    "country": 2,
    "MSU_ids": [
      575
    ],
    "summary": "Based on the provided information, the common theme appears to be the exploration of data clustering methods across multiple studies. The relationship between the sentences suggests a focus on the analysis and development of clustering techniques, indicating a shared interest in this specific aspect of data analysis."
  },
  {
    "hex_coord": [
      3,
      -15
    ],
    "country": 2,
    "MSU_ids": [
      576
    ],
    "summary": "The common theme across the provided sentences is the categorization of existing methods for temporal visualization, specifically into three categories: distance-based methods, density-based methods, and connectivity-based methods. These sentences likely discuss different approaches within the field of temporal visualization, indicating a structured overview rather than a coincidence."
  },
  {
    "hex_coord": [
      5,
      -6
    ],
    "country": 2,
    "MSU_ids": [
      596
    ],
    "summary": "The sentence indicates a focus on understanding the dynamic behavior of scramjet combustion processes through interpreting spatial and temporal patterns in simulation runs. The common theme appears to be the analysis of dynamic combustion behavior in scramjet engines, potentially involving computational simulations to decipher complex patterns."
  },
  {
    "hex_coord": [
      4,
      -10
    ],
    "country": 2,
    "MSU_ids": [
      607
    ],
    "summary": "After reviewing the provided sentence \"High-dimensional temporal data overload\" with an emphasis on the clustering algorithm's indication of positional closeness in different papers, it appears that the common theme is likely related to challenges or issues surrounding managing and analyzing high-dimensional temporal data. The relationship among the sentences seems to revolve around various aspects or perspectives on the complexities arising from processing such data, suggesting a shared focus on the intricacies of handling temporal data in high-dimensional spaces."
  },
  {
    "hex_coord": [
      -16,
      -3
    ],
    "country": 2,
    "MSU_ids": [
      608
    ],
    "summary": "Based on the provided sentence, the common theme among the papers appears to be the analysis or visualization of time-sequenced flow field data generated from simulations. This cluster does share a specific focus on the temporal visualization of flow field frames."
  },
  {
    "hex_coord": [
      -16,
      5
    ],
    "country": 2,
    "MSU_ids": [
      609
    ],
    "summary": "The sentence extracted from the paper *temporalvisMSU* discusses the limitation of traditional scalar metrics in capturing spatial and temporal transitions during combustion. This points to a common theme of the inadequacy of conventional metrics in understanding dynamic processes, suggesting a need for more comprehensive analytical approaches in studying combustion dynamics."
  },
  {
    "hex_coord": [
      5,
      -5
    ],
    "country": 2,
    "MSU_ids": [
      610
    ],
    "summary": "The common theme across the papers appears to be the visual clustering and summarization of combustion modes over time. This suggests a shared focus on methods for representing and analyzing temporal patterns in combustion processes."
  },
  {
    "hex_coord": [
      -6,
      4
    ],
    "country": 2,
    "MSU_ids": [
      611
    ],
    "summary": "Based on the information provided, the common theme across these sentences seems to be related to challenges in interpreting and visualizing temporal data, specifically in the context of understanding combustion evolution. These sentences likely share a specific focus on addressing the complexities of analyzing temporal dynamics in combustion processes."
  },
  {
    "hex_coord": [
      -5,
      5
    ],
    "country": 2,
    "MSU_ids": [
      612,
      643
    ],
    "summary": "The common theme among the sentences is the analysis of combustion dynamics concerning steady state, oscillatory, transitional behaviors, and ignition failures, with a focus on the impact of static temperature on chemical reactivity. These sentences likely discuss different aspects of combustion processes and their relationships with temperature effects, suggesting a closer semantic connection rather than being coincidental."
  },
  {
    "hex_coord": [
      5,
      -7
    ],
    "country": 2,
    "MSU_ids": [
      613
    ],
    "summary": "The sentence from the paper \"temporalvisMSU\" highlights the challenges of manual inspection, citing labor-intensiveness and subjectivity. The common theme in this cluster appears to revolve around the limitations of manual inspection processes in various contexts, possibly suggesting the need for automation or objective evaluation methods."
  },
  {
    "hex_coord": [
      -2,
      1
    ],
    "country": 2,
    "MSU_ids": [
      614
    ],
    "summary": "The sentence mentions the interpretation of combustion modes relying on expert knowledge, suggesting a focus on the understanding of combustion processes in a temporal visualization context. The relationship between the sentence and the broader theme likely involves the importance of expertise in interpreting visualized temporal data related to combustion modes."
  },
  {
    "hex_coord": [
      2,
      -15
    ],
    "country": 2,
    "MSU_ids": [
      615
    ],
    "summary": "Based on the provided information, the sentence suggests a common theme of addressing the challenge of capturing and sharing expertise within teams and automated systems, particularly in the context of temporal visualization. The proximity of the sentence to the paper title implies a specific focus on knowledge transfer mechanisms in the temporal visualization domain."
  },
  {
    "hex_coord": [
      -2,
      -7
    ],
    "country": 2,
    "MSU_ids": [
      617
    ],
    "summary": "The common theme across these sentences is the need for support systems to help experts identify and compare cases exhibiting similar behaviors under varying initial conditions. This suggests a shared focus on the challenges professionals face in analyzing dynamic data sets and temporal behavior patterns."
  },
  {
    "hex_coord": [
      0,
      -11
    ],
    "country": 2,
    "MSU_ids": [
      618,
      1024
    ],
    "summary": "The sentences from the papers on \"temporal visualization\" suggest a common focus on the challenges related to complexity in parameter-driven case comparison and the subjectivity introduced by expert annotation of cluster centroids. These concepts indicate a shared exploration of issues in data interpretation and visualization methodologies."
  },
  {
    "hex_coord": [
      4,
      -16
    ],
    "country": 2,
    "MSU_ids": [
      619,
      878
    ],
    "summary": "The two sentences provided are too brief and lack context to determine a clear common theme or specific relationship. They appear to discuss challenges and a case study without offering sufficient detail to ascertain a unified focus."
  },
  {
    "hex_coord": [
      3,
      -14
    ],
    "country": 2,
    "MSU_ids": [
      630
    ],
    "summary": "The sentence extracted from the paper \"temporalvisMSU\" emphasizes the importance of domain-informed requirements as the basis for the system pipeline and interaction design. This suggests a focus on the integration of domain knowledge in the development process."
  },
  {
    "hex_coord": [
      -14,
      4
    ],
    "country": 2,
    "MSU_ids": [
      640
    ],
    "summary": "The sentence from the paper \"temporalvisMSU\" mentions a range of static pressure from 0.8 MPa to 2.1 MPa. This singular sentence does not provide enough context to identify a common theme or specific topic shared across multiple papers. It appears to be an isolated data point rather than part of a cohesive discussion."
  },
  {
    "hex_coord": [
      -8,
      6
    ],
    "country": 2,
    "MSU_ids": [
      642
    ],
    "summary": "Based on the provided sentence, which discusses a static temperature range from 565 K to 830 K, the common theme appears to be thermal conditions or temperature variations in a specific context. The relationship among the sentences in this cluster is likely discussing different aspects or measurements related to temperature in various contexts. There isn't a strong indication that they share a specific, unified focus beyond temperature considerations."
  },
  {
    "hex_coord": [
      -10,
      5
    ],
    "country": 2,
    "MSU_ids": [
      644
    ],
    "summary": "The sentence provided, \"Static temperature influences ignition delay,\" hints at a common theme related to the impact of temperature on ignition processes. This suggests a shared focus on understanding the role temperature plays in ignition delay phenomena."
  },
  {
    "hex_coord": [
      -15,
      5
    ],
    "country": 2,
    "MSU_ids": [
      645
    ],
    "summary": "The sentence extracted from the paper \"temporalvisMSU\" indicates the range of water vapor content (H2O) observed, suggesting a focus on atmospheric water vapor levels or variability. The common theme appears to be the quantitative characterization of water vapor in the atmosphere, likely related to climate studies."
  },
  {
    "hex_coord": [
      -6,
      5
    ],
    "country": 2,
    "MSU_ids": [
      647,
      940
    ],
    "summary": "These sentences from the papers \"temporalvisMSU\" point towards the common theme of combustion processes. They discuss the influence of water vapor content on combustion efficiency and the use of hydroxyl radical (OH) as an indicator for combustion activity. The relationship between the sentences suggests a focused exploration of combustion dynamics."
  },
  {
    "hex_coord": [
      -14,
      6
    ],
    "country": 2,
    "MSU_ids": [
      650
    ],
    "summary": "The sentence extracted from the paper \"Temporal Evolution of Flow and Pressure Fields in MSU Engines\" suggests a common theme of analyzing the pressure field dynamics to understand the progression towards steady or oscillatory combustion states in engines. The relationship appears to focus on the temporal evolution of combustion-related processes in internal combustion engines, indicating a specific investigative direction rather than a merely coincidental proximity of ideas."
  },
  {
    "hex_coord": [
      -7,
      4
    ],
    "country": 2,
    "MSU_ids": [
      651
    ],
    "summary": "This cluster of sentences likely revolves around the theme of analyzing combustion activity and flame structure using the OH field as an indicator. The papers may share a focus on visualizing and understanding temporal aspects of combustion processes."
  },
  {
    "hex_coord": [
      9,
      -6
    ],
    "country": 2,
    "MSU_ids": [
      653
    ],
    "summary": "The common theme across the provided sentence is the use of a dataset as the empirical foundation for a visual analytics workflow. These sentences likely discuss different aspects or applications of utilizing datasets in visual analytics rather than sharing a specific, unified focus."
  },
  {
    "hex_coord": [
      4,
      0
    ],
    "country": 2,
    "MSU_ids": [
      661
    ],
    "summary": "Based on the information provided, the sentence \"The study addresses recognition (R2)\" likely suggests a focus on recognition, possibly within the context of temporal visualization. This cluster does not share a specific, unified focus beyond a broad reference to recognition."
  },
  {
    "hex_coord": [
      4,
      -8
    ],
    "country": 2,
    "MSU_ids": [
      662
    ],
    "summary": "The sentence extracted from the paper \"temporalvisMSU\" discusses the study's focus on semantic communication. This suggests a common theme of exploring semantic communication within the context of the paper. The relationship appears to be specific and aligned, pointing to a shared focus on this aspect within the paper."
  },
  {
    "hex_coord": [
      -1,
      0
    ],
    "country": 2,
    "MSU_ids": [
      663
    ],
    "summary": "Based on the provided sentence \"The study addresses parameter-aware case comparison (R4),\" it seems that the common theme among the papers revolves around the topic of parameter-aware case comparison. The relationship between the sentences appears to be discussing different aspects or approaches within this focus rather than being unrelated."
  },
  {
    "hex_coord": [
      -2,
      2
    ],
    "country": 2,
    "MSU_ids": [
      698
    ],
    "summary": "Based on the provided sentence from the paper titled \"temporalvisMSU,\" the common theme appears to be the localization of key combustion phenomena near specific zones, such as isolator and cavity regions, within the scramjet geometry. This suggests a focus on the spatial distribution and significance of combustion processes in scramjet engines."
  },
  {
    "hex_coord": [
      -13,
      -2
    ],
    "country": 2,
    "MSU_ids": [
      773
    ],
    "summary": "The common theme across the sentences appears to be the utilization of Dynamic Time Warping (DTW) for flexible temporal matching. This cluster likely discusses different aspects or applications of DTW in the context of temporal visualization or analysis."
  },
  {
    "hex_coord": [
      1,
      -12
    ],
    "country": 2,
    "MSU_ids": [
      787
    ],
    "summary": "The common theme across the sentences provided seems to revolve around the utilization of centroids for expert annotation in the context of temporal visualization.\n\nRelationship: The sentences appear to be discussing a similar aspect of utilizing centroids for expert annotation within the domain of temporal visualization, suggesting a focused alignment rather than mere coincidence."
  },
  {
    "hex_coord": [
      7,
      -10
    ],
    "country": 2,
    "MSU_ids": [
      826
    ],
    "summary": "Based on the given information, the single sentence extracted from the paper \"temporalvisMSU\" suggests a focus on supporting analysis at multiple levels. The common theme could potentially revolve around multi-level analysis capabilities within the context of temporal visualization. This indicates a shared focus on enabling enhanced data exploration and interpretation through different analytical perspectives."
  },
  {
    "hex_coord": [
      -12,
      -4
    ],
    "country": 2,
    "MSU_ids": [
      834
    ],
    "summary": "Based on the single sentence provided (\"The similarity metric is defined in the previous section\") and the paper title \"temporalvisMSU,\" it seems that the common theme relates to defining a similarity metric within the context of temporal visualization techniques. The relationship appears to be focused on explaining a specific concept within the broader topic of temporal visualization."
  },
  {
    "hex_coord": [
      -8,
      -1
    ],
    "country": 2,
    "MSU_ids": [
      945
    ],
    "summary": "The sentence provided seems to be related to combustion visualization and analysis within internal combustion engines, focusing specifically on the visualization of flame structures. This suggests a common theme of investigating spatial-temporal aspects of combustion processes, likely within the context of engine performance optimization."
  },
  {
    "hex_coord": [
      8,
      -9
    ],
    "country": 2,
    "MSU_ids": [
      976
    ],
    "summary": "The sentence suggests a focus on utilizing trajectory views, spatial clustering, and multiframe comparison as highlighted by expert E4. These techniques likely relate to the visualization and analysis of temporal data in some context, possibly within the field of data analysis or geospatial studies.\n\nRelationship: The sentence indicates a shared emphasis on specific visualization techniques for temporal data, suggesting a common theme of leveraging trajectory views, spatial clustering, and multiframe comparison for analysis. The proximity of these techniques in the sentences likely signifies a focused discussion on their combined use within a particular domain."
  },
  {
    "hex_coord": [
      7,
      -9
    ],
    "country": 2,
    "MSU_ids": [
      984
    ],
    "summary": "Based on the extracted sentence \"Experts consistently emphasized the benefit of visual-semantic alignment enabled by our workflow,\" the common theme among the papers appears to be the importance and advantages of visual-semantic alignment in a specific workflow. The relationship suggests a shared focus on this alignment rather than being disparate topics."
  },
  {
    "hex_coord": [
      -12,
      0
    ],
    "country": 2,
    "MSU_ids": [
      1012
    ],
    "summary": "Based on the provided sentence, it appears the common theme revolves around the challenge of triaging or grouping numerous cases in high-volume simulation settings. The sentence reflects a need to manage a large volume of cases efficiently, suggesting a focus on workflow optimization in such settings."
  },
  {
    "hex_coord": [
      -7,
      -6
    ],
    "country": 2,
    "MSU_ids": [
      1023
    ],
    "summary": "Based on the sentence provided \"Expert annotation of cluster centroids has proven effective in anchoring semantic generation,\" the common theme appears to be related to the effectiveness of expert annotation in guiding semantic generation processes, particularly in the context of cluster centroids. This cluster of sentences seems to discuss different aspects of how expert annotation influences semantic generation techniques, suggesting a focused discussion on the role of expert input in this context."
  },
  {
    "hex_coord": [
      6,
      -4
    ],
    "country": 2,
    "MSU_ids": [
      1034
    ],
    "summary": "The common theme across the papers is the development and application of a visual analytics workflow, particularly for expert-guided exploration, clustering, and interpretation of complex temporal flow-field data from scramjet combustion simulations. These sentences likely share a specific, unified focus on advanced visualization techniques for analyzing time-varying data."
  }
]
