[
  {
    "sentence": "If the pollutant readings at sensors A and B are identified to cause a considerable increase in those at sensor C consistently, proper measures should be taken to control the pollution at A and B rather than C.",
    "subtitle": "1 INTRODUCTION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 29,
    "para_id": 3,
    "paper_id": 0,
    "2d_coord": [
      1.2351231575012207,
      0.10559448599815369
    ],
    "MSU_id": 29,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Detecting and interpreting the causal relations among urban time series have important implications for various urban applications. Such causal relations can reveal the latent temporal interactions between the sensors where the urban time series are collected, facilitating the effective sense- making of urban phenomena and the informed policy- making for better sustainability [86]. For example, if the pollutant readings at sensors  $A$  and  $B$  are identified to cause a considerable increase in those at sensor  $C$  consistently, proper measures should be taken to control the pollution at  $A$  and  $B$  rather than  $C$ ."
  },
  {
    "sentence": "Fine-grained causality analyses enable analysts to gain insights into the temporal variations of causal relations in urban contexts.",
    "subtitle": "1 INTRODUCTION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 39,
    "para_id": 4,
    "paper_id": 0,
    "2d_coord": [
      0.7807595133781433,
      -0.06955105066299438
    ],
    "MSU_id": 39,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Many efforts have been devoted to the efficient extraction and extensive analysis of the co- occurrence [15, 36, 75] and correlation relations [45, 63] among urban time series or events. However, the patterns and insights derived in these studies do not imply true causality, and thus the reliability of the results is often limited in applications. Recent studies [38, 89] have investigated applying the Granger causality test to capture the causal relations among urban time series. Based on a set of urban time series, these studies attempt to extract a causal graph, where each cause- effect relation between a pair of sensors is represented with a directed edge. However, one causal graph is insufficient to characterize the dynamic causal relations among multiple urban time series due to the rapidly- changing urban environments. For example, a causal relation between two sensors detected based on their time series can disappear or even be flipped from time to time (Fig. 2a) because of certain external factors, such as the wind fields in the air pollution scenarios. Such a dynamic nature demands fine- grained causality analyses that enable analysts to gain insights into the temporal variations of causal relations in urban contexts. In addition to the limitation of granularity in the prior studies, interpreting and validating these causal relations detected by automated models also require an interactive system to integrate analysts in the urban causality analysis loop [76]."
  },
  {
    "sentence": "In sum, our contributions are as follows:",
    "subtitle": "1 INTRODUCTION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 70,
    "para_id": 9,
    "paper_id": 0,
    "2d_coord": [
      1.733582854270935,
      0.493834912776947
    ],
    "MSU_id": 70,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "In this study, we first conclude an analytical workflow and six user requirements through careful literature review and close collaboration with experts. Based on the requirements, we further develop Compass, a visual analytics system for the causal analysis of urban time series. Compass addresses the aforementioned three challenges as follows. For the first challenge, we propose a causal detection framework by extending the Granger causality test. This framework includes neighbor index, time partition, and debounce strategies to improve the capability of the causality test for urban time series. For the second challenge, we design a dynamic graph visualization to reveal the temporal variation of the detected causal relations and enable time- oriented drill- down analyses of causal graphs. For the third challenge, we consider the multiple dimensions of causal relations and propose a tailored visualization to expose causality suspiciousness. Finally, two real- world case studies on air pollution and traffic speed datasets, respectively, demonstrate the effectiveness of our approach. In sum, our contributions are as follows:"
  },
  {
    "sentence": "These guidelines help us design effective causal visualizations.",
    "subtitle": "2.2 Visual Causal Analytics",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 116,
    "para_id": 17,
    "paper_id": 0,
    "2d_coord": [
      0.5400843620300293,
      -0.03194749355316162
    ],
    "MSU_id": 116,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Causal analysis needs effective causality representations. Visualization studies have investigated causality perception. Xiong et al. [78] and Yen et al. [81] evaluated the performance of some basic charts (e.g., line and bar charts) in conveying causality. These basic charts are not suitable for causal graphs. Bae et al. [6, 7] derived several design guidelines for the graphical representation of causality. These guidelines help us design effective causal visualizations."
  },
  {
    "sentence": "The method aims to facilitate the in-depth understanding of urban problems.",
    "subtitle": "2.3 Visual Urban Analytics",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 151,
    "para_id": 24,
    "paper_id": 0,
    "2d_coord": [
      0.6184184551239014,
      -0.01929306983947754
    ],
    "MSU_id": 151,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Dynamic causality in urban space has not been studied. We propose a visual urban diagnosis method based on the dynamic causality of urban time series to facilitate the in- depth understanding of urban problems."
  },
  {
    "sentence": "As a statistical analysis method, causal analysis is not limited to computer scientists but can be accepted by urban practitioners with statistical knowledge.",
    "subtitle": "3.1 Problem Formulation",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 163,
    "para_id": 26,
    "paper_id": 0,
    "2d_coord": [
      1.009787678718567,
      -0.057097166776657104
    ],
    "MSU_id": 163,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "This study is the result of cooperation with multiple domains. On the one hand, rapid urbanization has resulted in many notorious urban problems, such as noise [9], traffic congestion [53], and water/air pollution [46]. On the other hand, various applications have proven the utility of causal analysis in providing valuable implications. In the past six months, we collaborated closely with three experts (EA, EB and EC). EA and EB are urban computing experts who have decades of experience studying data- driven solutions for urban problems. EC is a researcher with expertise in causal analyses. We together attempt to apply causal analysis to solve the urban problems. As a statistical analysis method, causal analysis is not limited to computer scientists but can be accepted by urban practitioners with statistical knowledge."
  },
  {
    "sentence": "The spatial complexity of causality can be reduced by focusing on the target areas of interest.",
    "subtitle": "3.3 Workflow and Requirement Analysis",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 185,
    "para_id": 31,
    "paper_id": 0,
    "2d_coord": [
      1.1430606842041016,
      0.2366679459810257
    ],
    "MSU_id": 185,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Our study adopts a sensor- centric strategy in the space dimension. A target sensor is specified as ego first, and then its neighbors that have potential causality will be retrieved. Only the causal relations between them will be detected and analyzed. In this way, the spatial complexity of causality can be reduced, and analysts can easily focus on the target areas of their interests. As for the time dimension, the time is properly partitioned into windows to reveal dynamic causalities. Causal detection works given an ego sensor and partitioned windows."
  },
  {
    "sentence": "Analysts can easily focus on the target areas of their interests.",
    "subtitle": "3.3 Workflow and Requirement Analysis",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 186,
    "para_id": 31,
    "paper_id": 0,
    "2d_coord": [
      1.1426498889923096,
      1.5162296295166016
    ],
    "MSU_id": 186,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Our study adopts a sensor- centric strategy in the space dimension. A target sensor is specified as ego first, and then its neighbors that have potential causality will be retrieved. Only the causal relations between them will be detected and analyzed. In this way, the spatial complexity of causality can be reduced, and analysts can easily focus on the target areas of their interests. As for the time dimension, the time is properly partitioned into windows to reveal dynamic causalities. Causal detection works given an ego sensor and partitioned windows."
  },
  {
    "sentence": "Scatterplots are more familiar to the experts than the PCP.",
    "subtitle": "5.4 Relation View",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 459,
    "para_id": 77,
    "paper_id": 0,
    "2d_coord": [
      0.5375621318817139,
      -0.14794349670410156
    ],
    "MSU_id": 459,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Justification. Each causal relation is an essentially multidimensional datum with seven dimensions (Fig. 7b- 1). Various visualizations have been proposed for this kind of data. Such as dimension reduction [68,88], scatterplot matrix [49], parallel coordinate plot (PCP) [10] and glyphs [82]. This view should satisfy two requirements, showing details and revealing suspiciousness. We have created two alternatives after exploring the design space. The first one is the spreadsheet that is commonly seen as a detail view (Fig. 7b- 1). However, it cannot handle many relations. The second one is the PCP (Fig. 7b- 2) better than the spreadsheet. Numerous causal relations can be displayed. The values of each dimension can be seen in the parallel axes. The first type of suspicious relations can be indicated by the gray lines passing the top of the distance axis (Fig. 7b- 2). Built on the PCP, we adopt scatterplots to visualize the dimensions related to the same causal direction (Fig. 6d). Scatterplots allow another suspiciousness metric, the Pearson's  $r$ , to be encoded using the size that can be accurately perceived. Besides, scatterplots are more familiar to the experts than the PCP."
  },
  {
    "sentence": "EA commented that all districts in Beijing should be treated as a whole for better air pollution control.",
    "subtitle": "6.1 Causal Analysis of Air Pollution Time Series",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 515,
    "para_id": 88,
    "paper_id": 0,
    "2d_coord": [
      2.1822257041931152,
      0.9451848268508911
    ],
    "MSU_id": 515,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "The experts first obtained the spatiotemporal summary (Fig. 1a). Fig. 1a- 1 showed that the sensors of Beijing strongly influenced each other because the large arrows and obvious overlaps were observed in the revised compass glyphs. EB explained that the pollutants transported back and forth in Beijing because of its terrain surrounded by mountains on three sides. EA commented \"all districts in Beijing should be treated as a whole for better air pollution control.\" The experts also learned that air pollutants of Beijing could be from Zhangjiakou and could propagate to Langfang (Fig. 1a- 2). They decided to analyze the fine- grained causality revealed by causal graphs after briefly understanding the detected causalities through this summary."
  },
  {
    "sentence": "EB said, 'although the time series were not highly correlated, the model captured the key features, i.e., the peaks, and obtained reasonable causalities.'",
    "subtitle": "6.1 Causal Analysis of Air Pollution Time Series",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 5,
    "msuid": 533,
    "para_id": 91,
    "paper_id": 0,
    "2d_coord": [
      0.3747483193874359,
      -0.01655179262161255
    ],
    "MSU_id": 533,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "A sharp peak in the third time window was first noticed. The heatmap below showed that the stimulus of an air pollution event spread from north to south (Fig. 1e- 1). After hovering over this band, the map view displayed the spatial causal graph (Fig. 1a- 1). However, some involved causal links were suspicious because they had low correlation coefficients indicated by the circle sizes in the relation view (Fig. 1d- 2). Given that, the experts unfolded this graph band to verify the causalities (Fig. 1c- 2). The orders in which the peaks appear in the two time series supported the causal directions detected by the model. The time differences of the peaks were also consistent with the lags. EB said, \"although the time series were not highly correlated, the model captured the key features, i.e., the peaks, and obtained reasonable causalities.\""
  },
  {
    "sentence": "EA explained that the low correlation might result from the long distance and geographical terrain between them.",
    "subtitle": "6.1 Causal Analysis of Air Pollution Time Series",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 541,
    "para_id": 93,
    "paper_id": 0,
    "2d_coord": [
      0.12813487648963928,
      0.7182028293609619
    ],
    "MSU_id": 541,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "First, the causal link with Zhangjiakou comprised two dissimilar time series (Fig. 8a- 1). The experts hovered over it and highlighted its relation curve in the relation view (Fig. 8b- 1). The large circle also implied a low correlation. Nonetheless, the expert scrutinized the time series carefully (Fig. 8a- 1) and learned that the time differences between the peaks in these two time series generally corresponded to the large lag. EA explained that the low correlation might result from the long distance and geographical terrain between them."
  },
  {
    "sentence": "EA and EB stated that causal relations between sensors can be of great help.",
    "subtitle": "6.1 Causal Analysis of Air Pollution Time Series",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 563,
    "para_id": 97,
    "paper_id": 0,
    "2d_coord": [
      0.7765073180198669,
      -0.06466221809387207
    ],
    "MSU_id": 563,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Finally, the experts deleted the incorrect causal links and obtained the causal relations as Fig. 8d. They further knew that the air pollutants generally propagated from the east to the west. EA and EB commented, \"identifying the sources of air pollution is a highly complex task, and these causal relations between sensors can be of great help.\""
  },
  {
    "sentence": "These fine-grained and dynamic causalities shed light on precise source identification.",
    "subtitle": "6.1 Causal Analysis of Air Pollution Time Series",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 566,
    "para_id": 98,
    "paper_id": 0,
    "2d_coord": [
      0.8189607262611389,
      -0.09203532338142395
    ],
    "MSU_id": 566,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "We showcased that the two most serious air pollution in Beijing were caused by the northwest and southeast areas, respectively. The time- oriented analysis disclosed these fine- grained and dynamic causalities that shed light on precise source identification and better policymaking that a static causal graph cannot support."
  },
  {
    "sentence": "These fine-grained and dynamic causalities support better policymaking.",
    "subtitle": "6.1 Causal Analysis of Air Pollution Time Series",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 567,
    "para_id": 98,
    "paper_id": 0,
    "2d_coord": [
      0.9163289070129395,
      -0.013604342937469482
    ],
    "MSU_id": 567,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "We showcased that the two most serious air pollution in Beijing were caused by the northwest and southeast areas, respectively. The time- oriented analysis disclosed these fine- grained and dynamic causalities that shed light on precise source identification and better policymaking that a static causal graph cannot support."
  },
  {
    "sentence": "Given these observations and the frequency, the experts thought that the causality between $r1$ and $r3$ can be ignored.",
    "subtitle": "6.2 Causal Analysis of Traffic Time Series",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 586,
    "para_id": 102,
    "paper_id": 0,
    "2d_coord": [
      0.6392305493354797,
      -0.02963271737098694
    ],
    "MSU_id": 586,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Pattern #1.  $r1\\rightarrow r3^{\\circ}$ $r1$  caused  $r3$  ) occurred only twice (Fig. 9e- 1), while others occurred many times. To figure out the reason, the experts unfolded the related graph bands where  $r1\\rightarrow r3$  exits and examined the two causal relations (Fig. 9c). The raw time series showed that the ups and downs in the red time series caused only slight fluctuations in the blue one. Given these observations and the frequency, the experts thought that the causality between  $r1$  and  $r3$  can be ignored. EA required to inspect the whole time series of  $r3$  further. The traffic conditions of  $r3$  were more stable compared with that of  $r1$  Fig.9d, which supported the experts' decision."
  },
  {
    "sentence": "The stability of $r3$ supported the experts' decision.",
    "subtitle": "6.2 Causal Analysis of Traffic Time Series",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 589,
    "para_id": 102,
    "paper_id": 0,
    "2d_coord": [
      1.7336647510528564,
      0.6183931827545166
    ],
    "MSU_id": 589,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Pattern #1.  $r1\\rightarrow r3^{\\circ}$ $r1$  caused  $r3$  ) occurred only twice (Fig. 9e- 1), while others occurred many times. To figure out the reason, the experts unfolded the related graph bands where  $r1\\rightarrow r3$  exits and examined the two causal relations (Fig. 9c). The raw time series showed that the ups and downs in the red time series caused only slight fluctuations in the blue one. Given these observations and the frequency, the experts thought that the causality between  $r1$  and  $r3$  can be ignored. EA required to inspect the whole time series of  $r3$  further. The traffic conditions of  $r3$  were more stable compared with that of  $r1$  Fig.9d, which supported the experts' decision."
  },
  {
    "sentence": "EA explained that the lack of causality detection on Sunday was because the traffic volume was small.",
    "subtitle": "6.2 Causal Analysis of Traffic Time Series",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 600,
    "para_id": 104,
    "paper_id": 0,
    "2d_coord": [
      0.6337582468986511,
      -0.0141105055809021
    ],
    "MSU_id": 600,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Pattern #3. No causality was detected on Sunday (Fig. 9e- 2). EA explained that this was because the traffic volume on Sundays was small. On Sundays, residents tend to rest at home instead of working overtime or traveling. EC also stated that even if residents wanted to go out, their departure times could be more varied than working days."
  },
  {
    "sentence": "EC stated that even if residents wanted to go out on Sundays, their departure times could be more varied than on working days.",
    "subtitle": "6.2 Causal Analysis of Traffic Time Series",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 602,
    "para_id": 104,
    "paper_id": 0,
    "2d_coord": [
      0.6233859658241272,
      0.11128038167953491
    ],
    "MSU_id": 602,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Pattern #3. No causality was detected on Sunday (Fig. 9e- 2). EA explained that this was because the traffic volume on Sundays was small. On Sundays, residents tend to rest at home instead of working overtime or traveling. EC also stated that even if residents wanted to go out, their departure times could be more varied than working days."
  },
  {
    "sentence": "These patterns can promote informed traffic management.",
    "subtitle": "6.2 Causal Analysis of Traffic Time Series",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 603,
    "para_id": 105,
    "paper_id": 0,
    "2d_coord": [
      0.6685063242912292,
      -0.07503417134284973
    ],
    "MSU_id": 603,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "These patterns can promote informed traffic management. For instance, managers should focus more on the vehicles from  $r4$  and  $r5$  to take timely measures, such as early warning and routing. Furthermore, traffic control may be omitted on Sundays, thereby saving resources."
  },
  {
    "sentence": "Managers should focus more on the vehicles from $r4$ and $r5$ to take timely measures.",
    "subtitle": "6.2 Causal Analysis of Traffic Time Series",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 604,
    "para_id": 105,
    "paper_id": 0,
    "2d_coord": [
      0.7918133735656738,
      -0.20337748527526855
    ],
    "MSU_id": 604,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "These patterns can promote informed traffic management. For instance, managers should focus more on the vehicles from  $r4$  and  $r5$  to take timely measures, such as early warning and routing. Furthermore, traffic control may be omitted on Sundays, thereby saving resources."
  },
  {
    "sentence": "Timely measures include early warning and routing.",
    "subtitle": "6.2 Causal Analysis of Traffic Time Series",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 605,
    "para_id": 105,
    "paper_id": 0,
    "2d_coord": [
      0.5794234275817871,
      -0.15559738874435425
    ],
    "MSU_id": 605,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "These patterns can promote informed traffic management. For instance, managers should focus more on the vehicles from  $r4$  and  $r5$  to take timely measures, such as early warning and routing. Furthermore, traffic control may be omitted on Sundays, thereby saving resources."
  },
  {
    "sentence": "Traffic control may be omitted on Sundays, thereby saving resources.",
    "subtitle": "6.2 Causal Analysis of Traffic Time Series",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 606,
    "para_id": 105,
    "paper_id": 0,
    "2d_coord": [
      0.6251450777053833,
      0.07659739255905151
    ],
    "MSU_id": 606,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "These patterns can promote informed traffic management. For instance, managers should focus more on the vehicles from  $r4$  and  $r5$  to take timely measures, such as early warning and routing. Furthermore, traffic control may be omitted on Sundays, thereby saving resources."
  },
  {
    "sentence": "EC said, 'It would be very interesting if the proposed methods are applied to other fields.'",
    "subtitle": "6.3 Expert Interviews",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 617,
    "para_id": 108,
    "paper_id": 0,
    "2d_coord": [
      1.8182648420333862,
      0.315470427274704
    ],
    "MSU_id": 617,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Usability and improvements. All experts confirmed the system usability. EA commented, \"Compass allows us to obtain fine- grained and dynamic urban causalities, which cannot be supported before.\" EC said, \"It would be very interesting if the proposed methods are applied to other fields.\" While the system has been confirmed to be satisfied with the user requirements, the experts provided suggestions on improving the usability further. EB required to modify or add neighbor sensors based on users' knowledge. We have implemented this function. EA and EC said that accessing actual video helps confirm the identified knowledge [66, 67, 77], e.g., the traffic causality in Sec. 6.2. Domain- specific views can be added when deploying to the actual scenarios."
  },
  {
    "sentence": "The experts provided suggestions on improving the usability further.",
    "subtitle": "6.3 Expert Interviews",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 2,
    "msuid": 619,
    "para_id": 108,
    "paper_id": 0,
    "2d_coord": [
      0.7601611018180847,
      -0.18027186393737793
    ],
    "MSU_id": 619,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Usability and improvements. All experts confirmed the system usability. EA commented, \"Compass allows us to obtain fine- grained and dynamic urban causalities, which cannot be supported before.\" EC said, \"It would be very interesting if the proposed methods are applied to other fields.\" While the system has been confirmed to be satisfied with the user requirements, the experts provided suggestions on improving the usability further. EB required to modify or add neighbor sensors based on users' knowledge. We have implemented this function. EA and EC said that accessing actual video helps confirm the identified knowledge [66, 67, 77], e.g., the traffic causality in Sec. 6.2. Domain- specific views can be added when deploying to the actual scenarios."
  },
  {
    "sentence": "Domain-specific views can be added when deploying to the actual scenarios.",
    "subtitle": "6.3 Expert Interviews",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 623,
    "para_id": 108,
    "paper_id": 0,
    "2d_coord": [
      1.3585697412490845,
      1.4026188850402832
    ],
    "MSU_id": 623,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Usability and improvements. All experts confirmed the system usability. EA commented, \"Compass allows us to obtain fine- grained and dynamic urban causalities, which cannot be supported before.\" EC said, \"It would be very interesting if the proposed methods are applied to other fields.\" While the system has been confirmed to be satisfied with the user requirements, the experts provided suggestions on improving the usability further. EB required to modify or add neighbor sensors based on users' knowledge. We have implemented this function. EA and EC said that accessing actual video helps confirm the identified knowledge [66, 67, 77], e.g., the traffic causality in Sec. 6.2. Domain- specific views can be added when deploying to the actual scenarios."
  },
  {
    "sentence": "This study is the first to extend the visual causal analysis to urban scenarios.",
    "subtitle": "7 DISCUSSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 5,
    "msuid": 624,
    "para_id": 109,
    "paper_id": 0,
    "2d_coord": [
      0.7678213119506836,
      -0.1451076865196228
    ],
    "MSU_id": 624,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Implications. This study is the first to extend the visual causal analysis to urban scenarios. First, we are aware of the dynamics of causality in urban environments. A causal detection framework and temporal visualizations are combined to unveil these dynamic causalities. The case studies demonstrate the dynamic causalities in air pollution phenomena and traffic situations. The static causal graphs detected by the previous methods will ignore these time- varying cause- effect relationships and thus cannot support accurate and informed decisions. Second, we observe the causalities detected by automatic models are not always reliable in urban domains. This observation supports other researchers' opinion [31, 76] that human knowledge needs to be integrated into the analysis loop for reliable analyses."
  },
  {
    "sentence": "This observation supports other researchers' opinion that human knowledge needs to be integrated into the analysis loop for reliable analyses.",
    "subtitle": "7 DISCUSSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 631,
    "para_id": 109,
    "paper_id": 0,
    "2d_coord": [
      1.8428027629852295,
      1.1881756782531738
    ],
    "MSU_id": 631,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Implications. This study is the first to extend the visual causal analysis to urban scenarios. First, we are aware of the dynamics of causality in urban environments. A causal detection framework and temporal visualizations are combined to unveil these dynamic causalities. The case studies demonstrate the dynamic causalities in air pollution phenomena and traffic situations. The static causal graphs detected by the previous methods will ignore these time- varying cause- effect relationships and thus cannot support accurate and informed decisions. Second, we observe the causalities detected by automatic models are not always reliable in urban domains. This observation supports other researchers' opinion [31, 76] that human knowledge needs to be integrated into the analysis loop for reliable analyses."
  },
  {
    "sentence": "The generalizability of Compass is two-fold.",
    "subtitle": "7 DISCUSSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 632,
    "para_id": 110,
    "paper_id": 0,
    "2d_coord": [
      0.6651820540428162,
      -0.17349326610565186
    ],
    "MSU_id": 632,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Generalizability. The generalizability of Compass is two- fold. In terms of application, the two real- world case studies have demonstrated that Compass can be easily applied to the urban time series data from different domains. Other potential applications include analyzing noise pollution [9], water pollution [1], and complex physical systems (e.g., IoT systems of tree ecosystem services [46]). For example, a river can be polluted by its upstream tributaries. Compass can help identify when the river is polluted and reveal which tributaries pollute it for each period when the pollution events are observed. In terms of visual analytics, Compass can be regarded as a model- free visual analytics approach and is not limited to the Granger causality test. Granger causality test is currently the most suitable method for our problem because of its wide use, interpretability, and ability to detect causality based on short partitioned time series. However, some recognized issues of the Granger causality test still exist. For example, it is a linear model [27]. Any better model proposed in the future can be easily integrated into our visual analytics system."
  },
  {
    "sentence": "Other potential applications of Compass include analyzing noise pollution, water pollution, and complex physical systems.",
    "subtitle": "7 DISCUSSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 634,
    "para_id": 110,
    "paper_id": 0,
    "2d_coord": [
      1.3020402193069458,
      0.1499384045600891
    ],
    "MSU_id": 634,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Generalizability. The generalizability of Compass is two- fold. In terms of application, the two real- world case studies have demonstrated that Compass can be easily applied to the urban time series data from different domains. Other potential applications include analyzing noise pollution [9], water pollution [1], and complex physical systems (e.g., IoT systems of tree ecosystem services [46]). For example, a river can be polluted by its upstream tributaries. Compass can help identify when the river is polluted and reveal which tributaries pollute it for each period when the pollution events are observed. In terms of visual analytics, Compass can be regarded as a model- free visual analytics approach and is not limited to the Granger causality test. Granger causality test is currently the most suitable method for our problem because of its wide use, interpretability, and ability to detect causality based on short partitioned time series. However, some recognized issues of the Granger causality test still exist. For example, it is a linear model [27]. Any better model proposed in the future can be easily integrated into our visual analytics system."
  },
  {
    "sentence": "Any better model proposed in the future can be easily integrated into our visual analytics system.",
    "subtitle": "7 DISCUSSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 639,
    "para_id": 110,
    "paper_id": 0,
    "2d_coord": [
      0.5490785837173462,
      -0.11258548498153687
    ],
    "MSU_id": 639,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Generalizability. The generalizability of Compass is two- fold. In terms of application, the two real- world case studies have demonstrated that Compass can be easily applied to the urban time series data from different domains. Other potential applications include analyzing noise pollution [9], water pollution [1], and complex physical systems (e.g., IoT systems of tree ecosystem services [46]). For example, a river can be polluted by its upstream tributaries. Compass can help identify when the river is polluted and reveal which tributaries pollute it for each period when the pollution events are observed. In terms of visual analytics, Compass can be regarded as a model- free visual analytics approach and is not limited to the Granger causality test. Granger causality test is currently the most suitable method for our problem because of its wide use, interpretability, and ability to detect causality based on short partitioned time series. However, some recognized issues of the Granger causality test still exist. For example, it is a linear model [27]. Any better model proposed in the future can be easily integrated into our visual analytics system."
  },
  {
    "sentence": "Utilizing the third dimension can be a potential solution and deserves further study.",
    "subtitle": "7 DISCUSSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 647,
    "para_id": 111,
    "paper_id": 0,
    "2d_coord": [
      1.37013840675354,
      1.4294378757476807
    ],
    "MSU_id": 647,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Limitations and future work. Three limitations are observed in this study. First, the system cannot support the analysis of complex causal graphs. Although ego graph- like causal graphs support an effective analysis for the target area, causal analyses can be enhanced with more complex causal graphs, such as by involving the relations between neighbor sensors. However, analyzing the complex graphs in a spatiotemporal context is challenging. For example, visual clutter is hard to avoid because the geo- fixed nodes make the causal graph layout methods inapplicable [65,76]. It also becomes difficult to clearly reveal the temporal variations of the detected causalities as the number of edges increases. Utilizing the third dimension can be a potential solution [5, 14, 62, 80] and deserves further study. Secondly, due to the lack of multi- source datasets in the same temporal and spatial scope, the effectiveness of our method in cross- domain causal analysis has not been proven. In fact, causality may exist between different urban datasets. For example, as the traffic volume increases, the air quality will deteriorate because cars emit exhaust gas and pollute the air [83]. In the future, we will collect richer datasets and conduct studies, thereby evaluating and improving our approaches. Finally, we found that when the number of links to be tested in all time windows is more than 150, the calculation time exceeds ten seconds. In the future, we will optimize the detection model, implement it with a more high- performance programming language, and deploy it to a distributed computing server."
  },
  {
    "sentence": "In the future, we will collect richer datasets and conduct studies, thereby evaluating and improving our approaches.",
    "subtitle": "7 DISCUSSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 651,
    "para_id": 111,
    "paper_id": 0,
    "2d_coord": [
      1.7767648696899414,
      1.2936383485794067
    ],
    "MSU_id": 651,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Limitations and future work. Three limitations are observed in this study. First, the system cannot support the analysis of complex causal graphs. Although ego graph- like causal graphs support an effective analysis for the target area, causal analyses can be enhanced with more complex causal graphs, such as by involving the relations between neighbor sensors. However, analyzing the complex graphs in a spatiotemporal context is challenging. For example, visual clutter is hard to avoid because the geo- fixed nodes make the causal graph layout methods inapplicable [65,76]. It also becomes difficult to clearly reveal the temporal variations of the detected causalities as the number of edges increases. Utilizing the third dimension can be a potential solution [5, 14, 62, 80] and deserves further study. Secondly, due to the lack of multi- source datasets in the same temporal and spatial scope, the effectiveness of our method in cross- domain causal analysis has not been proven. In fact, causality may exist between different urban datasets. For example, as the traffic volume increases, the air quality will deteriorate because cars emit exhaust gas and pollute the air [83]. In the future, we will collect richer datasets and conduct studies, thereby evaluating and improving our approaches. Finally, we found that when the number of links to be tested in all time windows is more than 150, the calculation time exceeds ten seconds. In the future, we will optimize the detection model, implement it with a more high- performance programming language, and deploy it to a distributed computing server."
  },
  {
    "sentence": "In the future, we will optimize the detection model, implement it with a more high-performance programming language, and deploy it to a distributed computing server.",
    "subtitle": "7 DISCUSSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 653,
    "para_id": 111,
    "paper_id": 0,
    "2d_coord": [
      1.7893280982971191,
      0.9870896935462952
    ],
    "MSU_id": 653,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "Limitations and future work. Three limitations are observed in this study. First, the system cannot support the analysis of complex causal graphs. Although ego graph- like causal graphs support an effective analysis for the target area, causal analyses can be enhanced with more complex causal graphs, such as by involving the relations between neighbor sensors. However, analyzing the complex graphs in a spatiotemporal context is challenging. For example, visual clutter is hard to avoid because the geo- fixed nodes make the causal graph layout methods inapplicable [65,76]. It also becomes difficult to clearly reveal the temporal variations of the detected causalities as the number of edges increases. Utilizing the third dimension can be a potential solution [5, 14, 62, 80] and deserves further study. Secondly, due to the lack of multi- source datasets in the same temporal and spatial scope, the effectiveness of our method in cross- domain causal analysis has not been proven. In fact, causality may exist between different urban datasets. For example, as the traffic volume increases, the air quality will deteriorate because cars emit exhaust gas and pollute the air [83]. In the future, we will collect richer datasets and conduct studies, thereby evaluating and improving our approaches. Finally, we found that when the number of links to be tested in all time windows is more than 150, the calculation time exceeds ten seconds. In the future, we will optimize the detection model, implement it with a more high- performance programming language, and deploy it to a distributed computing server."
  },
  {
    "sentence": "In the future, we will enhance the capability of Compass and deploy it to specific fields.",
    "subtitle": "8 CONCLUSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 659,
    "para_id": 112,
    "paper_id": 0,
    "2d_coord": [
      2.0746870040893555,
      0.6685628890991211
    ],
    "MSU_id": 659,
    "paper_info": "Compass Towards Better Causal Analysis of Urban Time Series",
    "paragraph_info": "This study presents a novel visual analytics approach that assists analysts in detecting and analyzing dynamic causalities in urban domains. We first extend the Granger causality test and propose a causal detection framework for dynamic urban causality. We then develop Compass by coordinating a set of well- designed visualizations. Compass facilitates analysts to interpret dynamic causal relations and improve causal detection results. We have demonstrated its effectiveness with case studies on real- world datasets and expert interviews. In the future, we will enhance the capability of Compass and deploy it to specific fields."
  },
  {
    "sentence": "The combined method had the best optimization effect over the whole domain.",
    "subtitle": "ABSTRACT",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 675,
    "para_id": 113,
    "paper_id": 1,
    "2d_coord": [
      2.258678674697876,
      1.0214654207229614
    ],
    "MSU_id": 675,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "In numerical model simulations, data assimilation (DA) on the initial conditions and bias correction (BC) of model outputs have been proven to be promising approaches to improving  $\\mathrm{PM}{2.5}$  (particulate matter with an aerodynamic equivalent diameter of  $\\leq 2.5\\mu \\mathrm{m}$ ) predictions. This study compared the optimization effects of these two methods and developed a new scheme that combines DA and BC simultaneously. Four parallel experiments were conducted during winter 2019: a control experiment directly forecasted by WRF- Chem (experiment name: WRF- Chem); an experiment that assimilated in situ observations based on the GSI (Gridpoint Statistical Interpolation) system (WRF- Chem_DA); an experiment with deep- learning- based BC (WRF- Chem_BC); and an experiment considering the combination of DA on the initial conditions and BC (WRF- Chem_DA_BC). Statistically, the accuracy of  $\\mathrm{PM}{2.5}$  predictions could be optimized by both DA and BC for the first 24- h period, and WRF- Chem_BC performed better than WRF- Chem_DA in the initial field, especially in the period of 10–24 h, while the best performance was achieved by combining BC and DA. Throughout the initial 24- h period, compared with the control experiment, the results of WRF- Chem_DA_BC (WRF- Chem_DA, WRF- Chem_BC) showed an improvement in terms of root- mean- square error, with reduction proportions varying from 38.90% to 48.86% (18.88% to 32.44%, 30.10% to 46.08%). Besides having the best optimization effect over the whole domain, the combined method also performed well in different regions: during the forecasting period of 0–24 h, the RMSEs decreased from 32% to 62%, 39% to 57%, 28% to 40%, and 30% to 49% in the Beijing- Tianjin- Hebei, Yangtze River Delta, Central China, and Sichuan Basin urban agglomerations, respectively."
  },
  {
    "sentence": "BC can to a certain extent make up for the limitations of initial field DA.",
    "subtitle": "1. Introduction",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 724,
    "para_id": 121,
    "paper_id": 1,
    "2d_coord": [
      2.2944014072418213,
      0.894157886505127
    ],
    "MSU_id": 724,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "Schwartz et al. (2012) used three different assimilation methods with MODIS (Moderate Resolution Imaging Spectroradiometer) AOD (aerosol optical depth) products and in situ  $\\mathrm{PM}{2.5}$  observations, and the results showed that all three methods improved the forecasting of aerosols. Song et al. (2021) used the 3DVAR (three- dimensional variational) approach to jointly assimilate meteorological data and in situ observations to improve the prediction of  $\\mathrm{PM}{2.5}$ . Hong et al. (2022) assimilated in situ observations and satellite data simultaneously to further improve  $\\mathrm{PM}{2.5}$  predictions. And in another study, different kinds of data were used in the assimilation of the initial field to analyze the enhancement of  $\\mathrm{PM}{2.5}$  forecasts by different assimilation sources (Ma et al., 2024). These previous studies have shown that DA can improve  $\\mathrm{PM}_{2.5}$  predictions by adjusting the initial state of the atmospheric chemistry, but the improvement of the prediction is limited, and the effect of assimilation gradually disappears with long- term integration of the simulation (Ma et al., 2024; Ma et al., 2020; Hong et al., 2022). In addition, the model prediction errors are not only affected by the uncertainty of the initial field, but also various other uncertainties such as those of the meteorological field and the physicochemical reactions (Zhu et al., 2018). Numerical model BC comprehensively considers the systematic errors of the model forecast to improve the forecast accuracy. Different from DA, which is the adjustment of the initial field from the model input perspective, BC is the post- processing of model outputs from the back end of the model, and can to a certain extent make up for the limitations of initial field DA."
  },
  {
    "sentence": "Machine-learning methods have shown strong advantages in mining nonlinear relationships.",
    "subtitle": "1. Introduction",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 740,
    "para_id": 122,
    "paper_id": 1,
    "2d_coord": [
      1.1888983249664307,
      0.7709881663322449
    ],
    "MSU_id": 740,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "BC is a statistical method that improves model predictions by establishing a relationship between historical observations and the corresponding model forecasts, from which the forecast bias can be extracted and the systematic errors corrected. With the advancements made in this line of research, BC methods have been developed from the earlier complete forecast method (Klein et al., 1959) to the model output statistical method (Glahn and Lowry, 1972), and then gradually evolved into different BC schemes. Frequency matching, Bayesian averaging, least- squares regression, multiple linear regression, and other statistical methods have been used to establish BC models, which significantly reduce systematic errors by learning the empirical relationships between historical forecasts and observations to realize BC (Raftery et al., 2005; Zhu and Luo, 2015; Xie et al., 2012; Chen et al., 2012; You, 2014). Recently, artificial- intelligence machine- learning techniques have emerged. Subsequently, BC based on machine- learning methods has been shown to better express the auxiliary links between various facets of the atmosphere, including, for instance, the different elements involved in atmospheric chemistry and key basic meteorological variables such as temperature and winds (Marzban, 2003; Zhang et al., 2022). Machine- learning models have been used in the BC of model outputs to improve  $\\mathrm{PM}{2.5}$  forecasts. For example, Ran et al. (2023) performed BC based on a multiple linear regression modeling approach to reduce the global  $\\mathrm{PM}{2.5}$  prediction bias; and Liu and Xing (2022a), Liu and Xing (2022b) designed a fully connected deep neural network to correct the  $\\mathrm{PM}{2.5}$  concentration bias in the outputs of chemical models, achieving better results than without the correction method applied. Ma et al. (2020) applied a time series model to correct  $\\mathrm{PM}{2.5}$  forecasts, which achieved good results. Different machine- learning methods were utilized by Li et al. (2021) as bias adjustment for postprocessing forecasts of  $\\mathrm{PM}{2.5}$  and  $\\mathrm{O}_3$ , showing the optimal approach to be the Random Forest model. Lu et al. (2020) utilized machine- learning methods to improve the accuracy of  $\\mathrm{PM}{2.5}$  forecasts through WRF- Chem in the Chengdu- Chongqing region. Overall, machine- learning methods have shown strong advantages in mining nonlinear relationships, enabling them to perform well in the BC of numerical predictions. However, they usually require massive, multi- source data inputs, which can limit their applicability in specific scenarios."
  },
  {
    "sentence": "The model has three advantages: acquisition of multiscale information, acquiring surrounding spatial information, and reducing information loss.",
    "subtitle": "2.4. Deep-learning-based BC",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 817,
    "para_id": 135,
    "paper_id": 1,
    "2d_coord": [
      1.8286820650100708,
      1.4347875118255615
    ],
    "MSU_id": 817,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "By adding a multiscale convolution module and depth- separable module based on the classical UNet deep- learning segmentation network (Ronneberger et al., 2015), a new deep- learning method was constructed for BC of WRF- Chem predictions, named MDS- UNet (Ma et al.,2024). Actually, a multiscale convolution module was joined to connect and extract different scales of feature maps, and the depth- separable convolution can compress the feature mapping. MDS- UNet shows advantages in multiscale feature learning due to its multiscale convolution module, as compared with the traditional UNet. The single convolution kernel in the traditional model can only catch some of the features of the pollutants with a fixed scale. However, pollution characteristics vary on different spatial scales and multiscale convolution adopts a hierarchical structure with different spatial sizes of convolution kernels to extract the multiscale features by learning feature maps from the image. By merging feature maps of different scale, not only the pollutant concentration values, but also the spatial information on pollutant distributions, can then be obtained. The model has three advantages: acquisition of multiscale information, acquiring surrounding spatial information, and reducing information loss."
  },
  {
    "sentence": "By combining DA and BC, the best improvements were yielded, showing the largest reductions in prediction RMSE.",
    "subtitle": "3.1. Comparison of forecast errors by different optimization methods",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 858,
    "para_id": 144,
    "paper_id": 1,
    "2d_coord": [
      2.2756588459014893,
      1.0265454053878784
    ],
    "MSU_id": 858,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "DA on the initial conditions improved the prediction accuracy by adjusting the initial field to optimize the model input, and BC made improvements by correcting the biases of the model output, which realized model optimization from different perspectives. The different improvements on the predictions achieved through DA and BC were evaluated with different error indicators. Fig. 3 shows the spatial performances of  $\\mathrm{PM}{2.5}$  prediction RMSEs averaged in winter produced by the different experiments. The prediction RMSEs in the control experiment were larger than those in the other three experiments, with high values mainly in BTH, YRD, CC, and some southwestern regions, and the RMSE even reached  $100\\mu \\mathrm{g} / \\mathrm{m}^3$  in some northern areas. By comparing Fig. 3a, 3b and 3c, it can be seen that both DA and BC were able to reduce the  $\\mathrm{PM}{2.5}$  prediction RMSE, despite different performances over different regions. Compared with the control experiment, the prediction RMSE in WRF- Chem_DA was  $20 - 40\\mu \\mathrm{g} / \\mathrm{m}^3$  lower over CC and YRD, while the DA improvements were small over BTH, where large RMSE values could still be seen. In contrast, the performances of BC were much better than those of DA, showing RMSE reductions over most areas in China, and the RMSE values were less than  $80\\mu \\mathrm{g} / \\mathrm{m}^3$  in the WRF- Chem_BC experiment. Thus, by combining DA and BC, the best improvements were yielded, showing the largest reductions in prediction RMSE, with values less than  $60\\mu \\mathrm{g} / \\mathrm{m}^3$ , in the WRF- Chem_DA_BC"
  },
  {
    "sentence": "This demonstrates some advantages of DA, but with limitations.",
    "subtitle": "3.1. Comparison of forecast errors by different optimization methods",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 871,
    "para_id": 146,
    "paper_id": 1,
    "2d_coord": [
      1.970633625984192,
      0.7734892964363098
    ],
    "MSU_id": 871,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "Fig. 4 presents the mean bias distributions of  $\\mathrm{PM}{2.5}$  predictions produced by the different experiments. As can be seen, WRF- Chem overestimated the  $\\mathrm{PM}{2.5}$  concentrations over some areas of SCB, CC, and YRD, with the prediction MB values reaching  $60\\mu \\mathrm{g} / \\mathrm{m}^3$  in some areas. A reason for this might be that the emissions inventory overestimated the winter emissions in the above regions and the model simulation was relatively more uncertain due to the complex terrain (Wei et al., 2022). In contrast, the  $\\mathrm{PM}{2.5}$  concentrations were underestimated in BTH, with the prediction MB ranging from  $- 60$  to  $- 20\\mu \\mathrm{g} / \\mathrm{m}^3$ . This performance whereby WRF- Chem always underestimates  $\\mathrm{PM}{2.5}$  concentrations over northern areas in China is a common problem, caused by not simulating secondary aerosols or the transformation mechanisms with their gaseous precursors (Ma, 2020; Wei et al., 2022; Qin et al., 2020; Wang et al., 2016). The prediction MB values were reduced by the DA and BC methods, but BC had better effects in terms of prediction improvement. Consistent with the results shown in Fig. 3, despite the adjustment to the original overestimation by DA in WRF- Chem_DA over some regions of SCB and CC, the prediction MB values could still reach  $60\\mu \\mathrm{g} / \\mathrm{m}^3$  in some areas, thus demonstrating some advantages of DA, but with limitations. Compared with the direct predictions of WRF- Chem, the prediction MB values in the WRF- Chem_BC experiment were reduced over most areas due to BC effects. It is worth noting that the original overestimation changed to an underestimation in the WRF- Chem_BC experiment over some regions of YRD and the Shandong Peninsula, which indicated overcorrection by BC. For WRF- Chem_DA_BC, the prediction MB was the smallest among all the experiments, with values less than  $20\\mu \\mathrm{g} / \\mathrm{m}^3$  over most areas. WRF- Chem_DA_BC showed a smaller prediction MB than WRF- Chem_BC, especially over the Shandong Peninsula and YRD regions."
  },
  {
    "sentence": "Combining DA and BC improved the consistency of the predictions and the observations.",
    "subtitle": "3.2. Comparison of the forecast consistency with observations achieved by different optimization methods",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 5,
    "msuid": 889,
    "para_id": 150,
    "paper_id": 1,
    "2d_coord": [
      2.2850537300109863,
      1.0604768991470337
    ],
    "MSU_id": 889,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "predictions produced directly by WRF_Chem and observations in the control experiment were in the range of 0.2 to 0.7, which is similar to previous studies (Hong et al., 2022). Both DA and BC were able to improve the consistency of the predictions with the observations, but the optimization effects of the BC method were more effective, with correlation coefficients of 0.4 to 0.8. As can be seen, the predictions produced by WRF- Chem_DA_BC showed the strongest consistency with observations, with  $R$  values of 0.7 to 0.85 for most time periods. Therefore, combining DA and BC improved the consistency of the predictions and the observations, and the optimization effect was the best among all the experiments."
  },
  {
    "sentence": "The optimization effect of combining DA and BC was the best among all the experiments.",
    "subtitle": "3.2. Comparison of the forecast consistency with observations achieved by different optimization methods",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 5,
    "msuid": 890,
    "para_id": 150,
    "paper_id": 1,
    "2d_coord": [
      2.1658003330230713,
      0.9820802211761475
    ],
    "MSU_id": 890,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "predictions produced directly by WRF_Chem and observations in the control experiment were in the range of 0.2 to 0.7, which is similar to previous studies (Hong et al., 2022). Both DA and BC were able to improve the consistency of the predictions with the observations, but the optimization effects of the BC method were more effective, with correlation coefficients of 0.4 to 0.8. As can be seen, the predictions produced by WRF- Chem_DA_BC showed the strongest consistency with observations, with  $R$  values of 0.7 to 0.85 for most time periods. Therefore, combining DA and BC improved the consistency of the predictions and the observations, and the optimization effect was the best among all the experiments."
  },
  {
    "sentence": "Overall, through adjustment of the model input field and correction of the model output, the predictions were effectively improved.",
    "subtitle": "3.2. Comparison of the forecast consistency with observations achieved by different optimization methods",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 902,
    "para_id": 151,
    "paper_id": 1,
    "2d_coord": [
      2.1491928100585938,
      0.9200942516326904
    ],
    "MSU_id": 902,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "The average  $\\mathrm{PM}{2.5}$  concentrations predicted by the four experiments and observed in the study period are given in Fig. 6. From the scatter fitting analysis results, WRF- Chem_DA_BC performed best in its consistency with observations following optimization. The results predicted directly by WRF- Chem in the control experiment were dispersed, with some isolated overestimation and underestimation scatter points fitted along the slope of 0.56, which demonstrates poor ability in simulating the high- pollution zones. By applying DA, the predictions of WRF- Chem_DA were partially improved, with an increased fitting slope of 0.69, showing less overestimation and underestimation through the adjustment of the initial field. The optimization of WRF- Chem_BC was much more evident than that of WRF- Chem_DA compared with the control experiment since the overestimation of the model was adjusted and the overall scatter distributions were more concentrated. However, there still existed an overall underestimation trend, with a slope of 0.73 after BC, which may not be sufficient for the simulation of strong pollution processes. It can be seen from Fig. 6a and 6d that the results of WRF- Chem_DA_BC were greatly improved by combining the two optimization methods, with the fitted slope of 1.04 being close to the straight line of  $k = 1$ . In this experiment, the  $\\mathrm{PM}{2.5}$  predictions were well adjusted and almost all of the high pollution could be captured, showing the best agreement with the observations. Overall, through adjustment of the model input field and correction of the model output, the predictions were effectively improved. It should be noted that the slope values in the control experiment and WRF- Chem_DA are close to those of previous results (Feng et al., 2018; Ma et al., 2024)."
  },
  {
    "sentence": "Since the optimization of BC was not sensitive to time, the improvement effects could be maintained with a normalized RMSE of 0.54 to 0.70 during the 0-24 h forecasting period.",
    "subtitle": "3.3. Influences of the different experimental configurations",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 921,
    "para_id": 155,
    "paper_id": 1,
    "2d_coord": [
      2.2235107421875,
      1.1132545471191406
    ],
    "MSU_id": 921,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "(RMSEs of the different experiments divided by the RMSE of the control experiment) series of  $\\mathrm{PM}{2.5}$  predictions with 0- 24- h forecasts. It is evident that all three experiments were able to improve the  $\\mathrm{PM}{2.5}$  predictions in terms of their RMSEs compared with the control experiment. The variations of the RMSE values produced by WRF- Chem and WRF- Chem_DA were similar to those in the results of previous studies (Hong et al., 2022; Peng et al., 2018a; Peng et al., 2018b; Ma et al., 2024). Both BC and DA reduced the  $\\mathrm{PM}{2.5}$  prediction RMSEs throughout the entire 24- h forecasting period, with reductions of  $17.89 - 33.61\\mu \\mathrm{g} / \\mathrm{m}^3$  and  $13.27 - 21.82\\mu \\mathrm{g} / \\mathrm{m}^3$ , respectively. During the first  $0 - 10\\mathrm{h}$ , the optimization effects of DA and BC were similar, but then BC started to perform better during 10- 24 h due to the timeliness of the DA in the initial field, which has also been reported in previous research (Jiang et al., 2013; Ma et al., 2024). Since the optimization of BC was not sensitive to time, the improvement effects could then be maintained, with a normalized RMSE of 0.54 to 0.70, during the 0- 24- h forecasting period. Comparatively, WRF- Chem_DA_BC produced more accurate  $\\mathrm{PM}{2.5}$  predictions than WRF- Chem_DA and WRF- Chem_BC during the first 24- h period, with an RMSE reduction of 23.52 to  $35.95\\mu \\mathrm{g} / \\mathrm{m}^3$  owing to the adjustment of the initial field for the model input and the correction of the output at the same time to achieve a double optimization. Overall, despite the positive effects on  $\\mathrm{PM}_{2.5}$  predictions, the optimization achieved by the different experiments varied; specifically, WRF- Chem_DA_BC was best, followed by WRF- Chem_BC, and then finally WRF- Chem_DA. The error values of predictions produced by WRF- Chem and WRF- Chem_DA were close to some previous DA results in China (Peng et al., 2018a; Peng et al., 2018b; Ma et al., 2024)."
  },
  {
    "sentence": "Despite the positive effects on PM2.5 predictions, the optimization achieved by the different experiments varied.",
    "subtitle": "3.3. Influences of the different experimental configurations",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 923,
    "para_id": 155,
    "paper_id": 1,
    "2d_coord": [
      2.123764991760254,
      1.058846116065979
    ],
    "MSU_id": 923,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "(RMSEs of the different experiments divided by the RMSE of the control experiment) series of  $\\mathrm{PM}{2.5}$  predictions with 0- 24- h forecasts. It is evident that all three experiments were able to improve the  $\\mathrm{PM}{2.5}$  predictions in terms of their RMSEs compared with the control experiment. The variations of the RMSE values produced by WRF- Chem and WRF- Chem_DA were similar to those in the results of previous studies (Hong et al., 2022; Peng et al., 2018a; Peng et al., 2018b; Ma et al., 2024). Both BC and DA reduced the  $\\mathrm{PM}{2.5}$  prediction RMSEs throughout the entire 24- h forecasting period, with reductions of  $17.89 - 33.61\\mu \\mathrm{g} / \\mathrm{m}^3$  and  $13.27 - 21.82\\mu \\mathrm{g} / \\mathrm{m}^3$ , respectively. During the first  $0 - 10\\mathrm{h}$ , the optimization effects of DA and BC were similar, but then BC started to perform better during 10- 24 h due to the timeliness of the DA in the initial field, which has also been reported in previous research (Jiang et al., 2013; Ma et al., 2024). Since the optimization of BC was not sensitive to time, the improvement effects could then be maintained, with a normalized RMSE of 0.54 to 0.70, during the 0- 24- h forecasting period. Comparatively, WRF- Chem_DA_BC produced more accurate  $\\mathrm{PM}{2.5}$  predictions than WRF- Chem_DA and WRF- Chem_BC during the first 24- h period, with an RMSE reduction of 23.52 to  $35.95\\mu \\mathrm{g} / \\mathrm{m}^3$  owing to the adjustment of the initial field for the model input and the correction of the output at the same time to achieve a double optimization. Overall, despite the positive effects on  $\\mathrm{PM}_{2.5}$  predictions, the optimization achieved by the different experiments varied; specifically, WRF- Chem_DA_BC was best, followed by WRF- Chem_BC, and then finally WRF- Chem_DA. The error values of predictions produced by WRF- Chem and WRF- Chem_DA were close to some previous DA results in China (Peng et al., 2018a; Peng et al., 2018b; Ma et al., 2024)."
  },
  {
    "sentence": "WRF-Chem_DA_BC was best, followed by WRF-Chem_BC, and then finally WRF-Chem_DA.",
    "subtitle": "3.3. Influences of the different experimental configurations",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 924,
    "para_id": 155,
    "paper_id": 1,
    "2d_coord": [
      2.078981637954712,
      1.0941202640533447
    ],
    "MSU_id": 924,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "(RMSEs of the different experiments divided by the RMSE of the control experiment) series of  $\\mathrm{PM}{2.5}$  predictions with 0- 24- h forecasts. It is evident that all three experiments were able to improve the  $\\mathrm{PM}{2.5}$  predictions in terms of their RMSEs compared with the control experiment. The variations of the RMSE values produced by WRF- Chem and WRF- Chem_DA were similar to those in the results of previous studies (Hong et al., 2022; Peng et al., 2018a; Peng et al., 2018b; Ma et al., 2024). Both BC and DA reduced the  $\\mathrm{PM}{2.5}$  prediction RMSEs throughout the entire 24- h forecasting period, with reductions of  $17.89 - 33.61\\mu \\mathrm{g} / \\mathrm{m}^3$  and  $13.27 - 21.82\\mu \\mathrm{g} / \\mathrm{m}^3$ , respectively. During the first  $0 - 10\\mathrm{h}$ , the optimization effects of DA and BC were similar, but then BC started to perform better during 10- 24 h due to the timeliness of the DA in the initial field, which has also been reported in previous research (Jiang et al., 2013; Ma et al., 2024). Since the optimization of BC was not sensitive to time, the improvement effects could then be maintained, with a normalized RMSE of 0.54 to 0.70, during the 0- 24- h forecasting period. Comparatively, WRF- Chem_DA_BC produced more accurate  $\\mathrm{PM}{2.5}$  predictions than WRF- Chem_DA and WRF- Chem_BC during the first 24- h period, with an RMSE reduction of 23.52 to  $35.95\\mu \\mathrm{g} / \\mathrm{m}^3$  owing to the adjustment of the initial field for the model input and the correction of the output at the same time to achieve a double optimization. Overall, despite the positive effects on  $\\mathrm{PM}_{2.5}$  predictions, the optimization achieved by the different experiments varied; specifically, WRF- Chem_DA_BC was best, followed by WRF- Chem_BC, and then finally WRF- Chem_DA. The error values of predictions produced by WRF- Chem and WRF- Chem_DA were close to some previous DA results in China (Peng et al., 2018a; Peng et al., 2018b; Ma et al., 2024)."
  },
  {
    "sentence": "These prediction statistics in different regions indicate the effectiveness and applicability of the combination of BC and DA in improving PM2.5 forecasts.",
    "subtitle": "3.3. Influences of the different experimental configurations",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 5,
    "msuid": 953,
    "para_id": 157,
    "paper_id": 1,
    "2d_coord": [
      2.25819730758667,
      1.08451509475708
    ],
    "MSU_id": 953,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "From Fig. 3 and Fig. 4, we can see that the prediction RMSEs of the control experiment were relatively larger in BTH due to its underestimation. The improvement of  $\\mathrm{PM}{2.5}$  predictions in BTH in terms of RMSE reductions by BC were more obvious than those by DA, with regional- average normalized RMSEs of 0.78- 0.87 and 0.41- 0.72, respectively, which was consistent with the RMSE and MB distributions. From the perspective of the regional- average RMSE, WRF- Chem_DA_BC produced a reduction in values of  $24.74 - 78.25\\mu \\mathrm{g} / \\mathrm{m}^3$  due to the combination of DA and BC effects, which shows its advantages over the other experiments in the BTH region. Both DA and BC were able to make adjustments to the overestimation of the  $\\mathrm{PM}{2.5}$  predictions in the control experiment in YRD and CC. However, despite their similar effects in the first  $10\\mathrm{h}$ , the optimization of BC was much better than DA in the later forecasting period since the effects of DA may decrease with the increase in the forecasting period. In SCB, the optimization of DA was not as good as that in CC and YRD due to the larger uncertainty caused by the complex terrain here (Wei et al., 2022), which caused the relatively similar effects of the WRF- Chem_BC and WRF- Chem_DA_BC experiments here. Overall, the effects of DA over YRD and CC were more obvious than over BTH and SCB. BC led to good performances over the whole 0- 24- h forecasting period, while DA effects may diminish with the increase in forecasting hours. By combining DA and BC in the WRF- Chem_DA_BC experiment, the consistency between  $\\mathrm{PM}{2.5}$  predictions and observations was improved greatly, showing the best forecast effects. The normalized RMSEs produced by WRF- Chem_DA_BC over BTH, YRD, CC, and SCB were 0.38- 0.68, 0.43- 0.61, 0.60- 0.72, and 0.51- 0.70, respectively. These prediction statistics in different regions also indicate the effectiveness and applicability of the combination of BC and DA in improving  $\\mathrm{PM}{2.5}$  forecasts."
  },
  {
    "sentence": "Further research is needed to address the lack of observations in some cities in Northeast China.",
    "subtitle": "3.4. 2.5.  $\\mathrm{PM}_{2.5}$  prediction results of WRF-Chem_DA_BC",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 979,
    "para_id": 161,
    "paper_id": 1,
    "2d_coord": [
      2.2908968925476074,
      0.888453483581543
    ],
    "MSU_id": 979,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "over central and eastern China; however, the predictions of WRF- Chem_DA_BC showed better consistency with observations. In the control experiment,  $\\mathrm{PM}{2.5}$  predictions were largely overestimated over YRD, CC, and around SCB, and underestimated in Shanxi Province, while the WRF- Chem_DA_BC experiment adjusted the concentrations in these regions. By combining the adjustment of the model input and corrections to the model output, the  $\\mathrm{PM}{2.5}$  prediction distribution and values were much closer to the observations, showing large advantages over these important regions examined in this study (Hong et al., 2022; Jiang et al., 2013; Ma et al., 2024). Despite the overall improvement associated with the combined application of DA and BC, there was still little or no improvement over some cities in Northeast China due to the lack of observations, which will need further research."
  },
  {
    "sentence": "Greater optimization might be achievable by the additional assimilation of air quality data through applying an inverse method to retrieve an optimized emission inventory.",
    "subtitle": "4.1. Discussion",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1009,
    "para_id": 166,
    "paper_id": 1,
    "2d_coord": [
      2.1809282302856445,
      1.0647718906402588
    ],
    "MSU_id": 1009,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "Despite the superior performance produced by combining DA and BC, certain aspects still need further discussion. In this study, we only considered the effect of DA through adjustment of the initial aerosol field, which may have had limitations on the optimization effects. The adjustment of emissions has been proved to be critical in terms of the improvement of aerosol predictions in previous studies (Henze et al., 2009; Ku and Park, 2011). As such, greater optimization might be achievable by the additional assimilation of air quality data through applying an inverse method to retrieve an optimized emission inventory based on the model configuration as in the WRF- Chem_DA_BC experiment, which will be analyzed in future work."
  },
  {
    "sentence": "The model configuration as in the WRF-Chem_DA_BC experiment will be analyzed in future work.",
    "subtitle": "4.1. Discussion",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 1010,
    "para_id": 166,
    "paper_id": 1,
    "2d_coord": [
      2.2350873947143555,
      1.0930285453796387
    ],
    "MSU_id": 1010,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "Despite the superior performance produced by combining DA and BC, certain aspects still need further discussion. In this study, we only considered the effect of DA through adjustment of the initial aerosol field, which may have had limitations on the optimization effects. The adjustment of emissions has been proved to be critical in terms of the improvement of aerosol predictions in previous studies (Henze et al., 2009; Ku and Park, 2011). As such, greater optimization might be achievable by the additional assimilation of air quality data through applying an inverse method to retrieve an optimized emission inventory based on the model configuration as in the WRF- Chem_DA_BC experiment, which will be analyzed in future work."
  },
  {
    "sentence": "To make our findings more robust through further comparisons, we intend to also apply the DA at 06:00, 12:00, and 18:00 in future research.",
    "subtitle": "4.1. Discussion",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 1013,
    "para_id": 167,
    "paper_id": 1,
    "2d_coord": [
      2.151313543319702,
      0.8815547823905945
    ],
    "MSU_id": 1013,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "In addition, we mainly focused on the effects of the new scheme combing DA on the initial conditions and BC and only considered the DA at 00:00 UTC. To make our findings more robust through further comparisons, we intend to also apply the DA at 06:00, 12:00 and 18:00 in the future research."
  },
  {
    "sentence": "Long-term predictions can be analyzed in future work.",
    "subtitle": "4.1. Discussion",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 1016,
    "para_id": 168,
    "paper_id": 1,
    "2d_coord": [
      0.9839006662368774,
      1.5107879638671875
    ],
    "MSU_id": 1016,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "Lastly, it should be acknowledged that we mainly compared and analyzed the results of the different experiments in a 0- 24- h forecasting period. Since BC is not sensitive to the length of the forecast, long- term predictions can be analyzed in future work. Also, since many methods have been used in the bias correction of numerical models, work will be carried out with other models in the future to make further comparisons with the results reported here."
  },
  {
    "sentence": "Work will be carried out with other models in the future to make further comparisons with the results reported here.",
    "subtitle": "4.1. Discussion",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1018,
    "para_id": 168,
    "paper_id": 1,
    "2d_coord": [
      1.841679334640503,
      0.8926600813865662
    ],
    "MSU_id": 1018,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "Lastly, it should be acknowledged that we mainly compared and analyzed the results of the different experiments in a 0- 24- h forecasting period. Since BC is not sensitive to the length of the forecast, long- term predictions can be analyzed in future work. Also, since many methods have been used in the bias correction of numerical models, work will be carried out with other models in the future to make further comparisons with the results reported here."
  },
  {
    "sentence": "The varied effectiveness of DA and BC indicates differences in optimization methods.",
    "subtitle": "4.2. Summary",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1031,
    "para_id": 170,
    "paper_id": 1,
    "2d_coord": [
      2.2862157821655273,
      1.0380760431289673
    ],
    "MSU_id": 1031,
    "paper_info": "Improving WRF-Chem PM2.5 predictions by combining data assimilation and deep-learning-based bias correction",
    "paragraph_info": "Both DA and BC improved  $\\mathrm{PM}_{2.5}$  predictions, but their performances showed differences among regions, indicating the varied effectiveness of these two optimization methods. Through the optimization achieved by DA, the prediction RMSE in WRF- Chem_DA was reduced by 20 to  $40\\mu \\mathrm{g} / \\mathrm{m}^3$  over CC and YRD compared with the control experiment. The performances of BC were much better than those of DA, showing larger RMSE reductions, and the RMSE values over most areas were less than  $80\\mu \\mathrm{g} / \\mathrm{m}^3$  in the WRF- Chem_BC experiment."
  },
  {
    "sentence": "This highlights the potential to greatly reduce the uncertainty in the most uncertain radiative forcing agent.",
    "subtitle": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1068,
    "para_id": 174,
    "paper_id": 2,
    "2d_coord": [
      2.012737989425659,
      0.3363579213619232
    ],
    "MSU_id": 1068,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "Absorbing aerosols emitted from biomass burning (BB) greatly affect the radiation balance, cloudiness, and circulation over tropical regions. Assessments of these impacts rely heavily on the modeled aerosol absorption from poorly constrained global models and thus exhibit large uncertainties. By combining the AeroCom model ensemble with satellite and in situ observations, we provide constraints on the aerosol absorption optical depth (AAOD) over the Amazon and Africa. Our approach enables identification of error contributions from emission, lifetime, and MAC (mass absorption coefficient) per model, with MAC and emission dominating the AAOD errors over Amazon and Africa, respectively. In addition to primary emissions, our analysis suggests substantial formation of secondary organic aerosols over the Amazon but not over Africa. Furthermore, we find that differences in direct aerosol radiative effects between models decrease by threefold over the BB source and outflow regions after correcting the identified errors. This highlights the potential to greatly reduce the uncertainty in the most uncertain radiative forcing agent."
  },
  {
    "sentence": "This challenge hinders reliable climate assessments over tropical regions.",
    "subtitle": "INTRODUCTION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1094,
    "para_id": 176,
    "paper_id": 2,
    "2d_coord": [
      1.8065450191497803,
      0.32065996527671814
    ],
    "MSU_id": 1094,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "Despite the recent progress in airborne measurements of BBA, large- scale and long- term assessments of the climate impacts of BBA have far relied on global aerosol models (14, 15). However, models have shown substantial discrepancies and errors regarding BBA absorption (16- 19), which remains a key obstacle to reliable climate assessments because BBA absorption can simultaneously contribute to direct, semidirect, and indirect aerosol effects (9, 20). Comparisons between models and satellite observations suggest that global models generally underestimate the overall warming impacts of BBA, as indicated by a substantial underestimation of the aerosol absorption optical depth (AAOD) (21) in combination with an overestimation of the single- scattering albedo (SSA) (20). These findings are supported by flight campaign measurements (22, 23) such as the ObseRvations of Aerosols above CLOUDs and their intEractionS (ORACLES) project (22), suggesting that the overall warming caused by BBA plumes is greater than previously considered, particularly in tropical regions. However, when considering the aerosol composition, global models tend to produce stronger absorption than observed from field and laboratory measurements for a given BC mass mixing ratio (24). The contradiction between the underestimated overall warming and overestimated absorbing capability per unit of BC mass highlights important errors in the emission, composition, and optical properties of absorbing BBA. Although there have been discussions regarding the possible reasons for these model errors [e.g., particle size distribution, vertical profiles, mixing states, and refractive index (24- 28)], a quantitative evaluation of how these factors contribute to the overall errors is still missing. This poses a fundamental challenge to the aerosol modeling community, which hinders reliable climate assessments over tropical regions."
  },
  {
    "sentence": "This work presents advancements by constraining MAC instead of MEC.",
    "subtitle": "INTRODUCTION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 5,
    "msuid": 1119,
    "para_id": 180,
    "paper_id": 2,
    "2d_coord": [
      1.993100643157959,
      0.2885614037513733
    ],
    "MSU_id": 1119,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "The overall procedure for constraining the above three components is somewhat similar to strategies commonly used in the context of \"emergent constraints,\" but we have introduced a closure relation (based on a simple box model) that allows estimating three components from two modeled relationships. It is similar to the methodology applied in a previous study (31), in which we analyze AOD and considered all aerosols instead of carbonaceous aerosols only. Briefly, we linearly regressed modeled MAC against modeled SSA and modeled  $\\tau$  against modeled precipitation and the angstrom exponent (AE; an indicator of ambient particle size) using the model data from the AeroCom (Aerosol Comparisons between Observations and Models; see table S1) project. Then, we applied satellite observations of SSA to estimate the constrained MAC and similarly constrain  $\\tau$  from observations of precipitation and AE. Last, we used Eq. 1 to constrain  $E$  The constrained values of  $E,\\tau ,$  and MAC allow us to attribute AAOD errors to contributions from these three factors for individual models. Uncertainty analysis is conducted for all these constraining processes as shown in Fig. 1. Notably, the constrained results are only effective on a regional and seasonal scale, and caution must be exercised when directly applying these results to smaller scales. This work presents advancements upon the foundation of (31) as it constrains MAC instead of MEC (mass extinction coefficient). In addition, we implement in situ data in the interpretation of satellite observations that allows a disaggregation of BC and OC emissions. Furthermore, in our seasonal, regional analysis, we find that SOA formation is important for fire aerosols over the Amazon but not over Africa."
  },
  {
    "sentence": "This suggests that the modeled relationship between MAC and SSA in AeroCom is robust.",
    "subtitle": "Constraining total emission, lifetime, and MAC",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1127,
    "para_id": 181,
    "paper_id": 2,
    "2d_coord": [
      1.969159722328186,
      0.09152939915657043
    ],
    "MSU_id": 1127,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "Despite the substantial variation in MAC values in the AeroCom models, we find a linear relationship between the modeled MAC and SSA (Fig. 2); both variables depend strongly on the BC mass mixing ratio within the total aerosols. Such a linear relationship compares favorably with in situ and laboratory observations (Fig. 2) (24). The relationship is also confirmed by Mie calculations with varying configurations (e.g., mixing state, refractive index, and particle size; fig. S2). This suggests that the modeled relationship between MAC and SSA in AeroCom is robust. We then combine satellite observation of SSA with the linear relationship to constrain the MAC."
  },
  {
    "sentence": "The agreement between AeroCom mean precipitation patterns and observations suggests that AeroCom mean wet deposition patterns are realistic.",
    "subtitle": "Constraining total emission, lifetime, and MAC",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1134,
    "para_id": 182,
    "paper_id": 2,
    "2d_coord": [
      2.054743766784668,
      0.04988217353820801
    ],
    "MSU_id": 1134,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "Similar to constraining MAC, we constrain aerosol lifetime via linear regression with precipitation and AE, as derived from AeroCom models and the satellite observations of the two predictors (fig. S3 and Materials and Methods). This relationship can be expected because precipitation and particle size affect aerosol removal, with a dominant impact from precipitation over our study regions (31, 32). AeroCom mean precipitation patterns agree very well with observations (see the correlations; fig. S4), suggesting that AeroCom mean wet deposition patterns are realistic."
  },
  {
    "sentence": "The accurate prediction of the AAOD provides independent confirmation on the above constraining analysis and error attribution.",
    "subtitle": "Constraining total emission, lifetime, and MAC",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 5,
    "msuid": 1161,
    "para_id": 187,
    "paper_id": 2,
    "2d_coord": [
      1.9875601530075073,
      0.19043341279029846
    ],
    "MSU_id": 1161,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "To verify the reliability of the constrained results, we predict the African outflow AAOD for the AeroCom models through a metamodel analysis (see text S2). We show that adopting the constrained results  $(E,\\tau ,$  and MAC) allows an accurate prediction of the AAOD over the African outflow region (fig. S7), providing independent confirmation on the above constraining analysis and error attribution."
  },
  {
    "sentence": "Lower emissions estimates partly explain the negative AAOD bias.",
    "subtitle": "BC and OA emissions in BB regions",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1173,
    "para_id": 188,
    "paper_id": 2,
    "2d_coord": [
      1.9812452793121338,
      0.20320135354995728
    ],
    "MSU_id": 1173,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "Although the above analysis highlights the errors in total emissions, it can provide more valuable insights if the total emissions can be speciated into either BC or OA emissions with a constrained rBC [i.e.,  $\\mathrm{BC:(\\bar{B}C + OA)}$ ]. To achieve this goal, we use the linear relationship observed by (24) between rBC and SSA to estimate ambient rBC from satellite observations of SSA. AeroCom models allow us to establish a relationship between ambient and emitted rBC, which, in any case, is close to identical (see Materials and Methods). These constrained BC and OA emissions can be compared with four widely used inventories of BC and OC emissions [i.e., Global Fire Emission Database version 4.1s (GFED), Global Fire Assimilation System version 1.2 (GFAS), Fire Energetics and Emission Research version 1.2 (FEER), and Quick Fire Emissions Dataset version 2.5 (QFED)], providing that we have reasonable OA/OC ratios (Fig. 4). Field measurements of primary BBA emissions exhibit a narrow range (1.5 to 1.9) for OA/OC (33- 39). We find that most inventories estimate lower emissions than our estimates over Africa, which partly explains the negative AAOD bias (Fig. 3B), as these inventories are used in AeroCom models (table S1)."
  },
  {
    "sentence": "The low OA emissions in the inventories over the Amazon result from missing sources.",
    "subtitle": "BC and OA emissions in BB regions",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 5,
    "msuid": 1182,
    "para_id": 189,
    "paper_id": 2,
    "2d_coord": [
      1.9209496974945068,
      0.11325353384017944
    ],
    "MSU_id": 1182,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "Inventories with underestimated emissions may be related to undetected small fires (40). The discrepancy is also affected by the variation in emission factor (EF), but it is unlikely to fully explain the low emissions, as the EFs used in the inventories generally agree with field measurements (see table S2 and fig. S8). In the Amazon, the inventories also estimate lower OA emission levels relative to our constrained OA. However, the BC inventory emissions are generally higher (except in the GFAS inventory), which is consistent with the overestimated MAC in models (Fig. 3A). Again, this cannot be explained by uncertainties in the EFs (fig. S8), which implies that the low OA emissions in the inventories over the Amazon result from missing sources."
  },
  {
    "sentence": "The agreement with in situ observations confirms the validity of the satellite measurements.",
    "subtitle": "Contribution of SOA formation to total OA",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1201,
    "para_id": 194,
    "paper_id": 2,
    "2d_coord": [
      2.0771572589874268,
      0.11491775512695312
    ],
    "MSU_id": 1201,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "too high to be explained in that way (44). Over the Amazon, formaldehyde correlates with both AOD and SSA, suggesting primarily an increase in non- or low- absorbing aerosols with higher formaldehyde columns (or more active SOA formation). In situ observations of OA and formaldehyde in smoke plumes (45) agree with our results (Fig. 4C), confirming the validity of the satellite measurements. Differently, there is no significant correlation between AOD and formaldehyde over Africa  $(P > 0.1$ ; Fig. 4D), consistent with the aforementioned low SOA contribution. Our results highlight the potential of detecting and constraining SOA formation from aerosol absorption."
  },
  {
    "sentence": "Our results highlight the potential of detecting and constraining SOA formation from aerosol absorption.",
    "subtitle": "Contribution of SOA formation to total OA",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 5,
    "msuid": 1204,
    "para_id": 194,
    "paper_id": 2,
    "2d_coord": [
      2.049790859222412,
      0.12224817276000977
    ],
    "MSU_id": 1204,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "too high to be explained in that way (44). Over the Amazon, formaldehyde correlates with both AOD and SSA, suggesting primarily an increase in non- or low- absorbing aerosols with higher formaldehyde columns (or more active SOA formation). In situ observations of OA and formaldehyde in smoke plumes (45) agree with our results (Fig. 4C), confirming the validity of the satellite measurements. Differently, there is no significant correlation between AOD and formaldehyde over Africa  $(P > 0.1$ ; Fig. 4D), consistent with the aforementioned low SOA contribution. Our results highlight the potential of detecting and constraining SOA formation from aerosol absorption."
  },
  {
    "sentence": "This indicates the potential of our methodology to greatly reduce the overall uncertainty of aerosol climate impacts.",
    "subtitle": "DISCUSSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 5,
    "msuid": 1242,
    "para_id": 198,
    "paper_id": 2,
    "2d_coord": [
      2.0579216480255127,
      0.3364129662513733
    ],
    "MSU_id": 1242,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "and MAC to total AAOD errors in the AeroCom models. Corrections for these identified errors bring two models more in line with the observations, confirming the reliability of our analysis. The corrections reduce the modeled uncertainty in the direct radiative effects by  $71\\%$  (from 4.5 to  $1.3 \\mathrm{~W} \\mathrm{~m}^{- 2}$ ) over the BB source regions, with an even larger reduction in the outflow areas (by  $86\\%$  from 4.2 to  $0.6 \\mathrm{~W} \\mathrm{~m}^{- 2}$ ). This indicates the potential of our methodology to greatly reduce the overall uncertainty of the aerosol climate impacts. The results also suggest the necessity of dealing with errors in refractive index, particle size distribution, and precipitation in models for future model development."
  },
  {
    "sentence": "The results suggest the necessity of dealing with errors in refractive index, particle size distribution, and precipitation in models for future model development.",
    "subtitle": "DISCUSSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1243,
    "para_id": 198,
    "paper_id": 2,
    "2d_coord": [
      2.044360399246216,
      0.19906753301620483
    ],
    "MSU_id": 1243,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "and MAC to total AAOD errors in the AeroCom models. Corrections for these identified errors bring two models more in line with the observations, confirming the reliability of our analysis. The corrections reduce the modeled uncertainty in the direct radiative effects by  $71\\%$  (from 4.5 to  $1.3 \\mathrm{~W} \\mathrm{~m}^{- 2}$ ) over the BB source regions, with an even larger reduction in the outflow areas (by  $86\\%$  from 4.2 to  $0.6 \\mathrm{~W} \\mathrm{~m}^{- 2}$ ). This indicates the potential of our methodology to greatly reduce the overall uncertainty of the aerosol climate impacts. The results also suggest the necessity of dealing with errors in refractive index, particle size distribution, and precipitation in models for future model development."
  },
  {
    "sentence": "Constraining SOA formation by aerosol absorption provides an innovative perspective on SOA estimation.",
    "subtitle": "DISCUSSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1249,
    "para_id": 199,
    "paper_id": 2,
    "2d_coord": [
      2.0768752098083496,
      0.08748555183410645
    ],
    "MSU_id": 1249,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "In addition to primary BB emissions, our analysis suggests that substantial SOA formation contributes to the modeled aerosol absorption errors over the Amazon but not over Africa. The remarkable regional difference may be associated with the variation in precursor gas emissions from biogenic sources, with a notably higher level of such emissions found over the Amazon than over Africa (fig. S14). In comparison, model estimates of SOA production are very uncertain and usually fail to show regional differences between the Amazon and Africa. Our estimation, to our knowledge, is the first one in which SOA formation is constrained by aerosol absorption, which provides an innovative perspective on SOA estimation. The results also highlight the importance of SOA during fire seasons. This particular aspect has often been overlooked, and our findings emphasize the need for further research."
  },
  {
    "sentence": "Our findings emphasize the need for further research.",
    "subtitle": "DISCUSSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 1252,
    "para_id": 199,
    "paper_id": 2,
    "2d_coord": [
      1.2044589519500732,
      0.7723052501678467
    ],
    "MSU_id": 1252,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "In addition to primary BB emissions, our analysis suggests that substantial SOA formation contributes to the modeled aerosol absorption errors over the Amazon but not over Africa. The remarkable regional difference may be associated with the variation in precursor gas emissions from biogenic sources, with a notably higher level of such emissions found over the Amazon than over Africa (fig. S14). In comparison, model estimates of SOA production are very uncertain and usually fail to show regional differences between the Amazon and Africa. Our estimation, to our knowledge, is the first one in which SOA formation is constrained by aerosol absorption, which provides an innovative perspective on SOA estimation. The results also highlight the importance of SOA during fire seasons. This particular aspect has often been overlooked, and our findings emphasize the need for further research."
  },
  {
    "sentence": "The integration provides a more comprehensive and robust conclusion than relying on a single data source.",
    "subtitle": "DISCUSSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1254,
    "para_id": 200,
    "paper_id": 2,
    "2d_coord": [
      1.6412382125854492,
      0.18835093080997467
    ],
    "MSU_id": 1254,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "Our work presents an integration of satellite and in situ observations, providing a more comprehensive and robust conclusion than relying on a single data source. Our work rigorously considers uncertainties in these observations. In particular, the satellite- derived aerosol absorption retrieval errors contribute the most to the overall uncertainty in this study (fig. S15), even when using the most reliable satellite products. This suggests that the impending improvement of satellite products will greatly reduce the uncertainty and promote the utility of our method."
  },
  {
    "sentence": "The impending improvement of satellite products will greatly reduce the uncertainty.",
    "subtitle": "DISCUSSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 1258,
    "para_id": 200,
    "paper_id": 2,
    "2d_coord": [
      1.9449939727783203,
      0.14517387747764587
    ],
    "MSU_id": 1258,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "Our work presents an integration of satellite and in situ observations, providing a more comprehensive and robust conclusion than relying on a single data source. Our work rigorously considers uncertainties in these observations. In particular, the satellite- derived aerosol absorption retrieval errors contribute the most to the overall uncertainty in this study (fig. S15), even when using the most reliable satellite products. This suggests that the impending improvement of satellite products will greatly reduce the uncertainty and promote the utility of our method."
  },
  {
    "sentence": "The improvement of satellite products will promote the utility of our method.",
    "subtitle": "DISCUSSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1259,
    "para_id": 200,
    "paper_id": 2,
    "2d_coord": [
      2.033559560775757,
      0.14434519410133362
    ],
    "MSU_id": 1259,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "Our work presents an integration of satellite and in situ observations, providing a more comprehensive and robust conclusion than relying on a single data source. Our work rigorously considers uncertainties in these observations. In particular, the satellite- derived aerosol absorption retrieval errors contribute the most to the overall uncertainty in this study (fig. S15), even when using the most reliable satellite products. This suggests that the impending improvement of satellite products will greatly reduce the uncertainty and promote the utility of our method."
  },
  {
    "sentence": "The construction of regional values is independent of the models used.",
    "subtitle": "Observation data",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1299,
    "para_id": 205,
    "paper_id": 2,
    "2d_coord": [
      2.0535240173339844,
      0.18972578644752502
    ],
    "MSU_id": 1299,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "To apply Eq. 1 in our analysis, a regional estimation of AAOD is required, which cannot be obtained directly from the sparsely sampled raw satellite data. Following the homogenization method in our previous work (31), we perform a linear regression between the modeled regional AAOD and modeled AAOD with POLDER- GRASP sampling (averaged over the region and fire season; fig. S17). The raw POLDER- GRASP data are then applied to the regression to estimate the regional AAOD. A similar method is also used to estimate the regional SSA. The robustness of the method is verified through a jackknife test by removing the models one by one, which produces small relative variations in the predicted regional AAOD and SSA (<1%), suggesting that the construction of regional values is independent of the models used. The regional observations of AAOD and SSA are also used to validate the models on a seasonal scale (see fig. S18), showing a varying degree of error per model. Broadly, models tend to underestimate SSA over the Amazon (by 0.05 on average) and underestimate AAOD over Southern Africa (by 32% on average)."
  },
  {
    "sentence": "The small absorption AE suggests that brown carbon is not important.",
    "subtitle": "Constraining BB carbonaceous aerosols in models",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 1320,
    "para_id": 207,
    "paper_id": 2,
    "2d_coord": [
      2.0300121307373047,
      0.08110076189041138
    ],
    "MSU_id": 1320,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "The overall constraining procedure is displayed in Fig. 1. The basic idea is to decompose AAOD into three interpretable factors: emission, lifetime, and MAC (see Eq. 1). The emission is calculated as the total of the BC and OA emissions; lifetime is calculated as the (burden of  $\\mathrm{BC + OA}$ )/emission of  $\\mathrm{BC + OA}$ , and MAC is AAOD/(burden of  $\\mathrm{BC + OA}$ ). All the variables are calculated as regional fire- season averages. Other absorbing components (e.g., dust) are assumed to have negligible impacts given the small contribution indicated by the observations (50) and AeroCom models (4%) for the two regions. In addition, we find a small absorption AE from POLDER- GRASP observations (fig. S19), suggesting that brown carbon is not important (51, 52). Note that the emission in Eq. 1 includes both primary emissions and those from secondary formation (SOA), as the latter happens on a much smaller time scale than the seasonal average that we are working with."
  },
  {
    "sentence": "This suggests that the SSA for total aerosols during fire seasons could sufficiently represent the aerosol criteria by (24).",
    "subtitle": "Constraining BB carbonaceous aerosols in models",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1335,
    "para_id": 211,
    "paper_id": 2,
    "2d_coord": [
      1.690062165260315,
      -0.004639685153961182
    ],
    "MSU_id": 1335,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "In addition to the total emissions for  $\\mathrm{BC + OA}$ , the rBC ratio is constrained in this work by using the observational relationship between SSA and ambient rBC at  $550~\\mathrm{nm}$  wavelength from (24). Here, we do not use the modeled relationship between rBC and SSA, as we find that it contains a large error (see fig. S6). It should be noted that the relationship by (24) was established under the criteria that OA and BC accounted for more than  $85\\%$  of the total aerosol mass (to focus on BBAs). For the AeroCom models, we compare the SSA for total aerosols and the SSA of grid cells with  $\\geq 85\\%$  carbonaceous aerosol components, with small differences being found for most models, especially within the range of the SSA observations (see fig. S20A). This suggests that the SSA for total aerosols during fire seasons could sufficiently represent the aerosol criteria by (24), which allows us to constrain the rBC in the ambient aerosols from SSA on the basis of the observed relationship. Using another regression to link the rBC from ambient aerosols to the emissions (see fig. S20B), we lastly obtain the constrained rBC in emissions and estimate the separate emissions for BC and OA."
  },
  {
    "sentence": "The overall uncertainty of our constraining analysis is primarily affected by observational errors.",
    "subtitle": "Constraining BB carbonaceous aerosols in models",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1345,
    "para_id": 212,
    "paper_id": 2,
    "2d_coord": [
      1.8904887437820435,
      0.20216795802116394
    ],
    "MSU_id": 1345,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "To assess the robustness of our constraining procedure, we use individual AeroCom models to serve as a truth and generate perfect (i.e., errorless) synthetic observations from it. The remaining models are then used to predict the emission, lifetime, and MAC of the truth run following the same procedure as described above (the regression between SSA and ambient rBC is replaced with the modeled relationship; see fig. S6). As shown in fig. S21, the predicted values agree well with truth model data, demonstrating the robustness of the methodology. In particular, the average of the absolute relative errors for predicted BC emissions are 17 and  $14\\%$  for the Amazon and Southern Africa, respectively, which are much smaller than the uncertainty in our main analysis using real observations. This suggests that the overall uncertainty of our constraining analysis is primarily affected by observational errors, as corroborated by our uncertainty analysis shown in fig. S15."
  },
  {
    "sentence": "This conclusion is corroborated by our uncertainty analysis shown in fig. S15.",
    "subtitle": "Constraining BB carbonaceous aerosols in models",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 2,
    "msuid": 1346,
    "para_id": 212,
    "paper_id": 2,
    "2d_coord": [
      1.8365163803100586,
      0.024123281240463257
    ],
    "MSU_id": 1346,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "To assess the robustness of our constraining procedure, we use individual AeroCom models to serve as a truth and generate perfect (i.e., errorless) synthetic observations from it. The remaining models are then used to predict the emission, lifetime, and MAC of the truth run following the same procedure as described above (the regression between SSA and ambient rBC is replaced with the modeled relationship; see fig. S6). As shown in fig. S21, the predicted values agree well with truth model data, demonstrating the robustness of the methodology. In particular, the average of the absolute relative errors for predicted BC emissions are 17 and  $14\\%$  for the Amazon and Southern Africa, respectively, which are much smaller than the uncertainty in our main analysis using real observations. This suggests that the overall uncertainty of our constraining analysis is primarily affected by observational errors, as corroborated by our uncertainty analysis shown in fig. S15."
  },
  {
    "sentence": "Incorporating variations in EFs would not fundamentally alter our SOA estimation.",
    "subtitle": "Uncertainties of the constraining analysis",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1369,
    "para_id": 215,
    "paper_id": 2,
    "2d_coord": [
      2.072821617126465,
      0.15806174278259277
    ],
    "MSU_id": 1369,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "value (52%; 45 to 58%) but still well within the associated uncertainty range. In Africa, a low SOA contribution of 1% is computed. These results suggest that incorporating variations in EFs would not alter our SOA estimation fundamentally, lending further support to the robustness of our SOA assessments."
  },
  {
    "sentence": "The robustness of our SOA assessments is further supported by these results.",
    "subtitle": "Uncertainties of the constraining analysis",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1370,
    "para_id": 215,
    "paper_id": 2,
    "2d_coord": [
      1.8550832271575928,
      0.059938520193099976
    ],
    "MSU_id": 1370,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "value (52%; 45 to 58%) but still well within the associated uncertainty range. In Africa, a low SOA contribution of 1% is computed. These results suggest that incorporating variations in EFs would not alter our SOA estimation fundamentally, lending further support to the robustness of our SOA assessments."
  },
  {
    "sentence": "The observation-based refractive index is more suitable than those used in the AeroCom models.",
    "subtitle": "Global model simulations and corrections",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1391,
    "para_id": 217,
    "paper_id": 2,
    "2d_coord": [
      1.958296775817871,
      0.23507246375083923
    ],
    "MSU_id": 1391,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "1) Particle size. The modeled ambient particle size is modified to match the observed AE. For ECHAM-HAM, we increase the emitted/ambient particle size by referring to our previous study (31). In SPRINTARS, we switch off the hygroscopic growth for OA which is likely too strong (57). Modifications to both models produce better agreement with the AE observations from POLDER-GRASP (fig. S22A). The AE bias in the default simulations and the corresponding improvement through corrections are further supported by AERONET observations (fig. S22B).\n2) Refractive index for BC. According to field measurements (58, 59), the imaginary part of refractive index of BC in the two models is changed to  $0.3i$ . Note that this value is lower than those used in the AeroCom models (0.44 to 0.79 for the imaginary part; see table S1). We conduct a sensitivity test on the imaginary part ranging from 0.1 to 0.5 with the corrected ECHAM-HAM model and find that the modified particle size with a value of 0.3 agrees the best with SSA observations from (24), suggesting that the observation-based refractive index is more suitable than those used in the AeroCom models (see fig. S23). In addition to SSA, this correction also results in better agreement with our constrained MAC for the two models (fig. S24). This refractive index is also used in a previous model study (60). Moreover, we also test different real parts of refractive index by changing values from 1.4 to 1.95 encompassing both observed values (61) and model-recommended values (see table S1). The resulting changes in AAOD are negligible  $(< 1\\%)$  and we maintain the default model values.\n3) Precipitation. A scaling factor is directly added to the modeled wet deposition based on the default precipitation error. This will correct the lifetime together with the modified particle size as stated above.\n4) Emissions. BC and total OA emissions (both primary emissions and those from secondary formation) are scaled to our constrained results."
  },
  {
    "sentence": "This will correct the lifetime together with the modified particle size.",
    "subtitle": "Global model simulations and corrections",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 1397,
    "para_id": 217,
    "paper_id": 2,
    "2d_coord": [
      2.106377124786377,
      0.3801231384277344
    ],
    "MSU_id": 1397,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "1) Particle size. The modeled ambient particle size is modified to match the observed AE. For ECHAM-HAM, we increase the emitted/ambient particle size by referring to our previous study (31). In SPRINTARS, we switch off the hygroscopic growth for OA which is likely too strong (57). Modifications to both models produce better agreement with the AE observations from POLDER-GRASP (fig. S22A). The AE bias in the default simulations and the corresponding improvement through corrections are further supported by AERONET observations (fig. S22B).\n2) Refractive index for BC. According to field measurements (58, 59), the imaginary part of refractive index of BC in the two models is changed to  $0.3i$ . Note that this value is lower than those used in the AeroCom models (0.44 to 0.79 for the imaginary part; see table S1). We conduct a sensitivity test on the imaginary part ranging from 0.1 to 0.5 with the corrected ECHAM-HAM model and find that the modified particle size with a value of 0.3 agrees the best with SSA observations from (24), suggesting that the observation-based refractive index is more suitable than those used in the AeroCom models (see fig. S23). In addition to SSA, this correction also results in better agreement with our constrained MAC for the two models (fig. S24). This refractive index is also used in a previous model study (60). Moreover, we also test different real parts of refractive index by changing values from 1.4 to 1.95 encompassing both observed values (61) and model-recommended values (see table S1). The resulting changes in AAOD are negligible  $(< 1\\%)$  and we maintain the default model values.\n3) Precipitation. A scaling factor is directly added to the modeled wet deposition based on the default precipitation error. This will correct the lifetime together with the modified particle size as stated above.\n4) Emissions. BC and total OA emissions (both primary emissions and those from secondary formation) are scaled to our constrained results."
  },
  {
    "sentence": "This result underscores the robustness of our methodology.",
    "subtitle": "Global model simulations and corrections",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 5,
    "msuid": 1410,
    "para_id": 219,
    "paper_id": 2,
    "2d_coord": [
      2.110414743423462,
      0.2852511405944824
    ],
    "MSU_id": 1410,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "In addition to the simulations for 2010, we extend our constraining analysis and model correction for the year 2009, which shows a lower AAOD observation than 2010  $(- 47\\%$  for the Amazon and  $- 10\\%$  for Africa). This assumes that the modeled relationships established from 2010 data are applicable to a different year, enabling us to use the 2009 observation data to constrain the models. Such an assumption is supported by the substantial model improvement after correction for 2009 (fig. S25). This compelling result underscores the robustness of our methodology, as it is independent of the specific year of model data chosen for analysis."
  },
  {
    "sentence": "The robustness of our methodology is independent of the specific year of model data chosen for analysis.",
    "subtitle": "Global model simulations and corrections",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 5,
    "msuid": 1411,
    "para_id": 219,
    "paper_id": 2,
    "2d_coord": [
      2.0028018951416016,
      0.1627645343542099
    ],
    "MSU_id": 1411,
    "paper_info": "Threefold reduction of modeled uncertainty in direct radiative effects over biomass burning regions by constraining absorbing aerosols",
    "paragraph_info": "In addition to the simulations for 2010, we extend our constraining analysis and model correction for the year 2009, which shows a lower AAOD observation than 2010  $(- 47\\%$  for the Amazon and  $- 10\\%$  for Africa). This assumes that the modeled relationships established from 2010 data are applicable to a different year, enabling us to use the 2009 observation data to constrain the models. Such an assumption is supported by the substantial model improvement after correction for 2009 (fig. S25). This compelling result underscores the robustness of our methodology, as it is independent of the specific year of model data chosen for analysis."
  },
  {
    "sentence": "The contributions of GeoChron are summarized.",
    "subtitle": "1 INTRODUCTION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 1488,
    "para_id": 228,
    "paper_id": 4,
    "2d_coord": [
      -0.2530849575996399,
      0.942335307598114
    ],
    "MSU_id": 1488,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "We propose GeoChron (chronicle of geo- space), an interactive visualization for large- scale ST series. For the first challenge, GeoChron includes a carefully- designed data mining framework. The framework slices the time span and captures reliable correlation relations between ST series in each time slice. Afterward, it employs a network formulation to fuse the correlation relations above and the spatial proximity in a semantic- preserving way and detect communities as evolution patterns. Consequently, the Storyline layout algorithm can be applied by considering each ST series as an entity and considering an evolution pattern as a session. For the second challenge, GeoChron supports a novel two- level visualization mechanism to present the spatiotemporal information of large- scale ST series. At the first level, we revise the Storyline with new interactions and visual encodings, and link it with a geographic map, to present evolution patterns from a high level of perspective. At the second level, we employ an EvoLens, a lens placed on the Storyline, to display more details regarding the temporal trends of evolution patterns in a narrative- preserving manner. The map is coordinated with the EvoLens to provide the detailed spatial context of evolution patterns. GeoChron is comprehensively evaluated by a series of studies and analyses. In sum, our contributions are as follows:"
  },
  {
    "sentence": "GeoChron expands Storyline's impact to the field of big spatiotemporal data analysis.",
    "subtitle": "1 INTRODUCTION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1496,
    "para_id": 229,
    "paper_id": 4,
    "2d_coord": [
      -0.32076525688171387,
      1.10463285446167
    ],
    "MSU_id": 1496,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "We propose a technique called GeoChron by leveraging the evolution pattern notion to meaningfully organize large- scale ST series into spatiotemporal partitions and visualize large- scale ST series in a pattern- aware and narrative- preserving way. We develop a data mining framework to extract evolution patterns (i.e., sessions) from large- scale ST series. We design a two- level visualization mechanism based on the classic Storyline representation to support effective visual analysis of large- scale ST series in a spatiotemporal context. We demonstrate the successful application of GeoChron through two real- world cases, which expands Storyline's impact to the field of big spatiotemporal data analysis."
  },
  {
    "sentence": "Visualizing these patterns over time can retain the temporal trends of ST series.",
    "subtitle": "2 RELATED WORK",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 1536,
    "para_id": 236,
    "paper_id": 4,
    "2d_coord": [
      -0.23893016576766968,
      1.1406545639038086
    ],
    "MSU_id": 1536,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "If large- scale ST series are depicted directly, analysts may find it hard to gain insights into data due to the sheer number of ST series to be investigated. By means of summarization or pattern extraction of large- scale ST series, analysts may not easily follow the temporal trends and dynamics of ST series between summaries or patterns. We define the evolution pattern in ST series and develop a framework to detect the patterns. Visualizing these patterns over time can retain the temporal trends of ST series. We aim to propose an evolution pattern- aware and narrative- preserving visualization for large- scale ST series."
  },
  {
    "sentence": "The narrative of temporal trends and dynamics is preserved between adjacent evolution patterns.",
    "subtitle": "3.2 Background and Research Problem",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 1588,
    "para_id": 246,
    "paper_id": 4,
    "2d_coord": [
      -0.11806488037109375,
      0.9924393892288208
    ],
    "MSU_id": 1588,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "According to our observations, each ST series is not isolated and is oftentimes correlated with others nearby due to the influence of certain events, exhibiting the evolution patterns defined above. Evolution patterns serve as an effective and meaningful entry to analyze multiple ST series at once. Furthermore, analysts can recover the trends of ST series by examining the patterns in two adjacent time periods if the patterns are placed over time. In this way, the narrative of temporal trends and dynamics is preserved between adjacent evolution patterns."
  },
  {
    "sentence": "Visualizing evolution patterns can aid in further analysis.",
    "subtitle": "3.2 Background and Research Problem",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1593,
    "para_id": 248,
    "paper_id": 4,
    "2d_coord": [
      -0.161033034324646,
      1.1087123155593872
    ],
    "MSU_id": 1593,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "Finally, evolution patterns may imply causation since they are built on correlation. Visualizing these patterns can aid in further analysis."
  },
  {
    "sentence": "After multiple iterations, five design goals are concluded.",
    "subtitle": "6.1 Design Goals",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 1689,
    "para_id": 270,
    "paper_id": 4,
    "2d_coord": [
      0.2561216950416565,
      1.0535829067230225
    ],
    "MSU_id": 1689,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "shortcomings and then improve the prototype for the next iteration. After multiple iterations, we conclude five design goals as follows."
  },
  {
    "sentence": "The final design satisfies the goals to effectively visualize large-scale spatio-temporal series.",
    "subtitle": "6.1 Design Goals",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1706,
    "para_id": 272,
    "paper_id": 4,
    "2d_coord": [
      -0.15057116746902466,
      1.2866525650024414
    ],
    "MSU_id": 1706,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "The final design satisfies these goals to effectively visualize largescale ST series. Below, we introduce the design from two aspects, namely, layout refinement and two- level visualization."
  },
  {
    "sentence": "Users know what their concerns are better than the machine.",
    "subtitle": "6.3.1 Tracking Overall Evolution Patterns",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 1793,
    "para_id": 289,
    "paper_id": 4,
    "2d_coord": [
      1.2100141048431396,
      0.4465217590332031
    ],
    "MSU_id": 1793,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "The coloring process is difficult to automate, nor should it be automated. There are innumerable coloring results with different visual patterns. We leave the process of visual pattern discovery to users because users know what their concerns are better than the machine."
  },
  {
    "sentence": "Encoding values by height allows them to be perceived more accurately.",
    "subtitle": "6.3.2 Drilling Down Into Evolution Patterns",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 1806,
    "para_id": 291,
    "paper_id": 4,
    "2d_coord": [
      -0.2105763554573059,
      1.2696495056152344
    ],
    "MSU_id": 1806,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "Showing detailed temporal trends (G3). The EvoLens (e.g., Fig. 6C) can be viewed as a len that enlarges the brushed sessions (e.g., Fig. 6A). Each session (e.g., Fig. 6A) is replaced with a line chart (e.g., Fig. 6C). If the entities belong to the same session, the corresponding time series are displayed as lines in the same line chart. Each line has the same color (without shades) as the curve in Storyline. The y- axis of all line charts represents the value range of all records. In this way, the recorded values in ST series are encoded by the height rather than the gradient shade and thus can be perceived more accurately. The line chart is the most common temporal visualization in people's daily life and most people are very familiar with it."
  },
  {
    "sentence": "Via the trend motif, the correlative trends of multiple ST series can be revealed in circumstances where the ST series are dissimilar in values from each other.",
    "subtitle": "6.3.2 Drilling Down Into Evolution Patterns",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 5,
    "msuid": 1819,
    "para_id": 292,
    "paper_id": 4,
    "2d_coord": [
      -0.19367825984954834,
      1.1815268993377686
    ],
    "MSU_id": 1819,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "Evolution patterns consider the correlated trends between time series. However, correlated ST series are sometimes not necessarily similar by values (e.g., Fig. 6E) but should have similar trends. To reveal their correlative trends, we design a trend motif (Fig. 6F). We denote the subpart of an ST series in a line chart as a sub- ST series. For a line chart, we respectively normalize each sub- ST series there according to its max and min values. For each time stamp in the line chart, we have a set of values, each of which is from a normalized sub- ST series. Afterward, we obtain the lower quartile  $q_{n}(0.25)$ , median, and upper quartile  $q_{n}(0.75)$  for these values. Finally, the lower and upper quartiles in all time stamps are visualized with an area. The medians in all time stamps form a median line. The line is superimposed with the area, constituting a trend motif. Via the trend motif, the correlative trends of multiple ST series can be revealed in circumstances where the ST series are dissimilar in values from each other. For example, the trend motif of Fig. 6F clearly shows an upward trend of the ST series in Fig. 6E."
  },
  {
    "sentence": "Via the interactions described, users can interactively investigate how ST time series evolve correlatively from a spatiotemporal perspective.",
    "subtitle": "6.3.2 Drilling Down Into Evolution Patterns",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1838,
    "para_id": 295,
    "paper_id": 4,
    "2d_coord": [
      0.27343231439590454,
      1.4911174774169922
    ],
    "MSU_id": 1838,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "Investigating evolution patterns in space and time. EvoLens is coordinated with the map (G4). When users hover over a time slice (Day 3 in Fig. 6C), the map displays the geographic distribution of each session in this time slice (Fig. 6B). Specifically, we generate a convex hull on the map for each session to cover the dots the session comprises. The number of sessions in this view is less than in the Storyline so that we can overlay visual elements on the map. When users hover over a line chart, the borders of both the line chart and the hull become thicker. Via the above interactions, users can interactively investigate how ST time series evolve correlatively from a spatiotemporal perspective."
  },
  {
    "sentence": "Testing the hypotheses requires additional data and in-depth analysis.",
    "subtitle": "Drilling Down into Evolution Patterns.",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1918,
    "para_id": 307,
    "paper_id": 4,
    "2d_coord": [
      1.0513057708740234,
      0.3973292112350464
    ],
    "MSU_id": 1918,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "First, the purple and green ST series were distributed in the center and geographically close (Fig. 1D, D2, and D3). Their readings had correlatively increased and reached a high level of air pollution within the first three days (Fig. 1E and F). Afterward (Day 4), the purple and green ST series became uncorrelated as the purple ST ones continuously increased while the green ones fluctuated. They separated into left and right regions (Fig. 1D4). Second, the black ST series were less correlated with others and the readings did not rise very high (Fig. 1E1). It might be because of the sea breeze blowing from three sides blew away air pollution quickly. Finally, the red ST series experienced a decrease on the third day, followed by an increase during the final three days, whereas the other ST series remained on a downward trend (Fig. 1E and F). A hypothesis suggests that during the last three days, an additional pollution source may have polluted the BTH region. Testing the hypotheses requires additional data and in- depth analysis [10, 13]."
  },
  {
    "sentence": "The observations implied that there might be propagation processes of air pollution from north to south in the first two/three days.",
    "subtitle": "Drilling Down into Evolution Patterns.",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1937,
    "para_id": 310,
    "paper_id": 4,
    "2d_coord": [
      -0.2513825297355652,
      1.1953415870666504
    ],
    "MSU_id": 1937,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "At first, half of the orange ST series were correlated with the purple ones (Day 1 in Fig. 6C). Afterward, the orange ST series separated into another session because they had a subtle drop during the period of Fig. 6D1. As a result, the orange ST series reached a high level of air pollution one day later than the purple one. In the last three days (Days 3, 4, and 5 in Fig. 6C), the orange and purple ST series had slightly different trends and both exhibited subtle declines around 4 pm each day, indicated by the red dashed line in Fig. 6D. The above observations implied that there might be propagation processes of air pollution from north to south in the first two/three days. Afterwards, the air in both regions was filled with air pollutants. The fluctuation/decline trends in the orange and purple ST series were different since the industrial structure and pollution purification capabilities of the two regions were different. We consulted historical weather data, and at that time Yangtze River Delta did receive strong cold air from the north, which caused blizzards and brought massive air pollutants."
  },
  {
    "sentence": "The fluctuation/decline trends in the orange and purple ST series were different due to the different industrial structure and pollution purification capabilities of the two regions.",
    "subtitle": "Drilling Down into Evolution Patterns.",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 1939,
    "para_id": 310,
    "paper_id": 4,
    "2d_coord": [
      0.2618069052696228,
      1.6089942455291748
    ],
    "MSU_id": 1939,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "At first, half of the orange ST series were correlated with the purple ones (Day 1 in Fig. 6C). Afterward, the orange ST series separated into another session because they had a subtle drop during the period of Fig. 6D1. As a result, the orange ST series reached a high level of air pollution one day later than the purple one. In the last three days (Days 3, 4, and 5 in Fig. 6C), the orange and purple ST series had slightly different trends and both exhibited subtle declines around 4 pm each day, indicated by the red dashed line in Fig. 6D. The above observations implied that there might be propagation processes of air pollution from north to south in the first two/three days. Afterwards, the air in both regions was filled with air pollutants. The fluctuation/decline trends in the orange and purple ST series were different since the industrial structure and pollution purification capabilities of the two regions were different. We consulted historical weather data, and at that time Yangtze River Delta did receive strong cold air from the north, which caused blizzards and brought massive air pollutants."
  },
  {
    "sentence": "It can be seen that all participants, even P6, did understand GeoChron's visualizations.",
    "subtitle": "8.2 Informal User Study",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 2004,
    "para_id": 321,
    "paper_id": 4,
    "2d_coord": [
      -0.25437068939208984,
      1.0406337976455688
    ],
    "MSU_id": 2004,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "Results. All participants quickly and correctly located the periods in Fig. 5G and H for task 1 and the period in Fig. 6A for task 2. For task 3, all participants made descriptions similar to the case presented in Sec. 8.1.1. In particular, they all noticed 1) a small decline in the orange ST series on the first day (Fig. 6D1), 2) a rise in the orange ST series a day after the rise in the purple ST series, and 3) the medium/high level all ST series reached on the third day (Day 3 in Fig. 6C). It can be seen that all participants, even P6, did understand GeoChron's visualizations."
  },
  {
    "sentence": "It can be concluded that the sliding window does improve the readability of representations.",
    "subtitle": "8.3 Ablation Study and Parameter Analysis",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 2042,
    "para_id": 326,
    "paper_id": 4,
    "2d_coord": [
      -0.24711179733276367,
      1.0739970207214355
    ],
    "MSU_id": 2042,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "We test the curve hiding and sliding windows via ablation studies following the first case. First, we set  $th_w = +Infinity$  to disable the curve hiding. Fig. 9A shows a snapshot of the result. The nearly vertical curves bounce up and down on the screen, resulting in visual distractions. Moreover, some aligned sessions are meant to be visually continuous, but this continuity is broken by these curves (e.g., Fig. 9B). Smaller the  $th_w$ , the less clutter. Second, we directly use the correlation coefficients in time slices rather than sliding windows and generate the layout in Fig. 9C with the same parameters in the first case ( $th_s = 7$  and  $th_c = 3$ ). We remove the gradient shade and focus on the layout. Compared with the time window- based results in Fig. 5D, the correlation relationship between ST series is more dynamic. In particular, the dashed ellipses in Fig. 9D and E highlight the unexpected deviation of curves. Entities part suddenly and come back together again, which may be due to the slightly offset time slices, subtle pollution events, or errors. Such deviations lead to visual clusters and prevent users from locating prominent visual patterns. It can be concluded that the sliding window does improve the readability of representations."
  },
  {
    "sentence": "Users can still analyze those sessions with small sizes when $th_c$ is increased.",
    "subtitle": "8.3 Ablation Study and Parameter Analysis",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 2050,
    "para_id": 327,
    "paper_id": 4,
    "2d_coord": [
      -0.19469773769378662,
      1.258535623550415
    ],
    "MSU_id": 2050,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "Afterward, we study how loose alignment and session filtering affect the layout of GeoChron via parameter analysis on  $th_s$  and  $th_c$ . We obtain different layouts generated under different combinations of  $th_s$  and  $th_c$ . Then, we use the average height of all time slices to quantify each layout's height (Fig. 10A). The layout is high when these two parameters are small (e.g., Fig. 10F). Users may have difficulty browsing the visualization. Increasing the two parameters can compact the layout. They work by different principles. On the one hand, in creasing  $th_c$  results in the layout with looser alignment (e.g., Fig. 10G). Users can still analyze those sessions with small sizes. On the other hand, increasing  $th_s$  results in the layout of Fig. 5A or D, where fewer sessions are displayed (Fig. 10B)."
  },
  {
    "sentence": "First, interactive layout refining is useful.",
    "subtitle": "9 DISCUSSION AND CONCLUSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 2080,
    "para_id": 333,
    "paper_id": 4,
    "2d_coord": [
      -0.06489574909210205,
      1.32177734375
    ],
    "MSU_id": 2080,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "Lessons. We have two lessons. First, interactive layout refining is useful. There are many possibilities for the visual layout of large- scale data. An ideal layout for the proposed visualization is hard to determine automatically. Users may have personalized analysis interests that are hard to quantify for automated optimization. In GeoChron, users are able to interactively refine the layout according to their needs, making a trade- off between information completeness and readability. In this way, the smoothness of layout adjustment needs to be guaranteed."
  },
  {
    "sentence": "This allows users to make a trade-off between information completeness and readability.",
    "subtitle": "9 DISCUSSION AND CONCLUSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 2085,
    "para_id": 333,
    "paper_id": 4,
    "2d_coord": [
      -0.2958822250366211,
      1.1085236072540283
    ],
    "MSU_id": 2085,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "Lessons. We have two lessons. First, interactive layout refining is useful. There are many possibilities for the visual layout of large- scale data. An ideal layout for the proposed visualization is hard to determine automatically. Users may have personalized analysis interests that are hard to quantify for automated optimization. In GeoChron, users are able to interactively refine the layout according to their needs, making a trade- off between information completeness and readability. In this way, the smoothness of layout adjustment needs to be guaranteed."
  },
  {
    "sentence": "The multilevel strategy could be the first choice to improve the scalability of big data analysis.",
    "subtitle": "9 DISCUSSION AND CONCLUSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 2090,
    "para_id": 334,
    "paper_id": 4,
    "2d_coord": [
      0.5296688675880432,
      0.430930495262146
    ],
    "MSU_id": 2090,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "Second, multilevel visualization is suitable for large- scale data. GeoChron adopts the two- level visualization in a compactly laid- out Storyline such that the Storyline becomes applicable to large- scale ST series. We suggest that the multilevel strategy [12, 18, 21, 34] could be the first choice to improve the scalability of big data analysis."
  },
  {
    "sentence": "GeoChron can be applied to various kinds of data in addition to geo-spatial time series.",
    "subtitle": "9 DISCUSSION AND CONCLUSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 2100,
    "para_id": 336,
    "paper_id": 4,
    "2d_coord": [
      -0.2752447724342346,
      0.9251387119293213
    ],
    "MSU_id": 2100,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "Generalizability. GeoChron can be applied to various kinds of data in addition to geo- spatial time series. First, visualizing cross- domain geo- spatial time series can reveal in- depth knowledge. For example, air quality is oftentimes correlated to temperature or traffic conditions [61]. To accommodate potential heterogeneity, the correlation modeling method should be replaced with one suitable for heterogeneous data."
  },
  {
    "sentence": "Visualizing cross-domain geo-spatial time series can reveal in-depth knowledge.",
    "subtitle": "9 DISCUSSION AND CONCLUSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 2101,
    "para_id": 336,
    "paper_id": 4,
    "2d_coord": [
      0.6021698713302612,
      1.6650798320770264
    ],
    "MSU_id": 2101,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "Generalizability. GeoChron can be applied to various kinds of data in addition to geo- spatial time series. First, visualizing cross- domain geo- spatial time series can reveal in- depth knowledge. For example, air quality is oftentimes correlated to temperature or traffic conditions [61]. To accommodate potential heterogeneity, the correlation modeling method should be replaced with one suitable for heterogeneous data."
  },
  {
    "sentence": "In the future, we plan to study level-of-detail rendering to support larger scale data.",
    "subtitle": "9 DISCUSSION AND CONCLUSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 2111,
    "para_id": 338,
    "paper_id": 4,
    "2d_coord": [
      -0.0875856876373291,
      1.2649900913238525
    ],
    "MSU_id": 2111,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "Limitations and Future Work. Our study has two limitations. First, GeoChron may take up a lot of horizontal space if there are too many time slices, requiring the user to scroll a lot horizontally. Although this issue can be potentially solved by increasing the size of slices, it may reduce the granularity and result in information loss. Besides, GeoChron may take up a lot of vertical space when the number of ST series increases. Although we allow users to refine and compress the layout, small but important patterns may be hidden in this way. In the future, we plan to study level- of- detail rendering to support larger scale data [8], for example, by abstracting the representation further [73]."
  },
  {
    "sentence": "We plan to support larger scale data by abstracting the representation further.",
    "subtitle": "9 DISCUSSION AND CONCLUSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 2112,
    "para_id": 338,
    "paper_id": 4,
    "2d_coord": [
      -0.13689637184143066,
      1.142298936843872
    ],
    "MSU_id": 2112,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "Limitations and Future Work. Our study has two limitations. First, GeoChron may take up a lot of horizontal space if there are too many time slices, requiring the user to scroll a lot horizontally. Although this issue can be potentially solved by increasing the size of slices, it may reduce the granularity and result in information loss. Besides, GeoChron may take up a lot of vertical space when the number of ST series increases. Although we allow users to refine and compress the layout, small but important patterns may be hidden in this way. In the future, we plan to study level- of- detail rendering to support larger scale data [8], for example, by abstracting the representation further [73]."
  },
  {
    "sentence": "Addressing such an issue needs further studies of the layout algorithm and visualization.",
    "subtitle": "9 DISCUSSION AND CONCLUSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 2116,
    "para_id": 339,
    "paper_id": 4,
    "2d_coord": [
      -0.1846008598804474,
      1.2166461944580078
    ],
    "MSU_id": 2116,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "Second, one ST series can be in multiple patterns. To reflect the situation, the curve should be split into multiple sessions. Yet, the splitting curve may exacerbate visual clutter. Addressing such an issue needs further studies of the layout algorithm and visualization."
  },
  {
    "sentence": "This paper presents GeoChron, an effective visualization for large-scale ST series.",
    "subtitle": "9 DISCUSSION AND CONCLUSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 5,
    "msuid": 2121,
    "para_id": 341,
    "paper_id": 4,
    "2d_coord": [
      -0.3076591491699219,
      1.158601999282837
    ],
    "MSU_id": 2121,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "Conclusion. This paper presents GeoChron, an effective visualization for large- scale ST series. We formulate the problem of visualizing large- scale ST series as an evolution pattern visualization problem that Storyline techniques can solve well. To apply Storyline techniques, GeoChron includes a mining framework for extracting evolution patterns from ST series and a two- level visualization mechanism for improved visual scalability. As a result, GeoChron enables pattern- aware and narrative- preserving visualization of large- scale ST series."
  },
  {
    "sentence": "GeoChron enables pattern-aware and narrative-preserving visualization of large-scale ST series.",
    "subtitle": "9 DISCUSSION AND CONCLUSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 5,
    "msuid": 2126,
    "para_id": 341,
    "paper_id": 4,
    "2d_coord": [
      -0.28087449073791504,
      1.1112565994262695
    ],
    "MSU_id": 2126,
    "paper_info": "Volume-Based Space-Time Cube for Large-Scale Continuous Spatial Time Series",
    "paragraph_info": "Conclusion. This paper presents GeoChron, an effective visualization for large- scale ST series. We formulate the problem of visualizing large- scale ST series as an evolution pattern visualization problem that Storyline techniques can solve well. To apply Storyline techniques, GeoChron includes a mining framework for extracting evolution patterns from ST series and a two- level visualization mechanism for improved visual scalability. As a result, GeoChron enables pattern- aware and narrative- preserving visualization of large- scale ST series."
  },
  {
    "sentence": "It is easy for users to accept and learn the spacetime cube.",
    "subtitle": "I. INTRODUCTION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 2,
    "msuid": 2162,
    "para_id": 345,
    "paper_id": 3,
    "2d_coord": [
      1.2456471920013428,
      1.961519718170166
    ],
    "MSU_id": 2162,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "The effective composition of spatial and temporal visualizations has long been the most challenging problem in the visualization of spatiotemporal data beyond ST series [4], [5]. Linked views require users to pay context- switching costs to browse the spatial and temporal visualizations separately. In contrast, an integrated view tightly organizes the spatial and temporal visualizations to reduce such costs. The spacetime cube (STC) [6] is a kind of integrated view in a three- dimensional space, in which the space naturally occupies two dimensions (i.e., x- y plane), and the time constitutes the third dimension (i.e., z- axis). The position of the visual graphics can be directly related to both space and time dimensions. It is easy for users to accept and learn, and thus, users can perceive time and space simultaneously [7]. Moreover, in the STC, the evolution of spatiotemporal phenomena can be effectively conveyed through temporal narratives, as geographic- related information is visualized along a continuous timeline [8]."
  },
  {
    "sentence": "Users can perceive time and space simultaneously in the spacetime cube.",
    "subtitle": "I. INTRODUCTION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 2163,
    "para_id": 345,
    "paper_id": 3,
    "2d_coord": [
      1.1584571599960327,
      2.0096852779388428
    ],
    "MSU_id": 2163,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "The effective composition of spatial and temporal visualizations has long been the most challenging problem in the visualization of spatiotemporal data beyond ST series [4], [5]. Linked views require users to pay context- switching costs to browse the spatial and temporal visualizations separately. In contrast, an integrated view tightly organizes the spatial and temporal visualizations to reduce such costs. The spacetime cube (STC) [6] is a kind of integrated view in a three- dimensional space, in which the space naturally occupies two dimensions (i.e., x- y plane), and the time constitutes the third dimension (i.e., z- axis). The position of the visual graphics can be directly related to both space and time dimensions. It is easy for users to accept and learn, and thus, users can perceive time and space simultaneously [7]. Moreover, in the STC, the evolution of spatiotemporal phenomena can be effectively conveyed through temporal narratives, as geographic- related information is visualized along a continuous timeline [8]."
  },
  {
    "sentence": "In the spacetime cube, the evolution of spatiotemporal phenomena can be effectively conveyed through temporal narratives.",
    "subtitle": "I. INTRODUCTION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 2164,
    "para_id": 345,
    "paper_id": 3,
    "2d_coord": [
      0.7936043739318848,
      1.7838213443756104
    ],
    "MSU_id": 2164,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "The effective composition of spatial and temporal visualizations has long been the most challenging problem in the visualization of spatiotemporal data beyond ST series [4], [5]. Linked views require users to pay context- switching costs to browse the spatial and temporal visualizations separately. In contrast, an integrated view tightly organizes the spatial and temporal visualizations to reduce such costs. The spacetime cube (STC) [6] is a kind of integrated view in a three- dimensional space, in which the space naturally occupies two dimensions (i.e., x- y plane), and the time constitutes the third dimension (i.e., z- axis). The position of the visual graphics can be directly related to both space and time dimensions. It is easy for users to accept and learn, and thus, users can perceive time and space simultaneously [7]. Moreover, in the STC, the evolution of spatiotemporal phenomena can be effectively conveyed through temporal narratives, as geographic- related information is visualized along a continuous timeline [8]."
  },
  {
    "sentence": "The combination of the space-time cube and 3D volume visualization effectively presents large-scale spatiotemporal series with less context switching cost and visual occlusion.",
    "subtitle": "B. Research Problem and Solution",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 2327,
    "para_id": 376,
    "paper_id": 3,
    "2d_coord": [
      1.0945332050323486,
      1.8606016635894775
    ],
    "MSU_id": 2327,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "We realize that many spatiotemporal phenomena are essentially continuous in both the space and time domains, such as meteorological phenomena like rainfall, humidity, and temperature, and air pollution. Due to the limited number of sensors and their limited monitoring capabilities, the recorded ST series of these phenomena exhibit discreteness in the time and space domains. Targeting such a kind of ST series, we propose VolumeSTCube towards better visualization of large- scale ST series. It first transforms the discrete ST series data into continuous space- time volumetric data following the strategy of the space- time cube. Afterward, the volume- based visualization is designed and then equipped with a set of flexible interactions. The combination of the space- time cube and 3D volume visualization effectively presents large- scale ST series with less context switching cost and visual occlusion."
  },
  {
    "sentence": "It becomes easier for the user to relate the visualization to the spatial context as the map is closer to the visualization.",
    "subtitle": "D. Interactions",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 2445,
    "para_id": 400,
    "paper_id": 3,
    "2d_coord": [
      1.20600163936615,
      1.9548022747039795
    ],
    "MSU_id": 2445,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "action hides any voxels below the selected position. Next, the user activates a second x- y plane and moves it to the endpoint of the time range, filtering out any voxels above this position. This dual- plane approach slices the volume along the desired time interval, as illustrated in Figure 6E1, F1, and G1. While dragging each plane, the associated timestamp is displayed. It also becomes easier for the user to relate the visualization to the spatial context as the map is closer to the visualization."
  },
  {
    "sentence": "The acceptable accuracy of Kriging interpolation ensures the reliability of subsequent analyses.",
    "subtitle": "V. EVALUATION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 2501,
    "para_id": 411,
    "paper_id": 3,
    "2d_coord": [
      1.5035028457641602,
      1.673783779144287
    ],
    "MSU_id": 2501,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "We have a real- world AQI (air quality index) ST series dataset, collected from 448 air quality monitoring stations in China (Figure 5(left)). In the whole evaluation section, the geographic space is divided into a  $350 \\times 350$  grid. The time span is from January 1 to December 20, 2018, and the temporal granularity is one hour. In sum, the dataset comprises 448 (stations)  $\\times 8,472$  (timesteps) values, ranging from 0 to 500. Each value in the dataset is the AQI at the timestamp of a monitoring station. The higher the value, the worse the air quality. In the data transformation procedure, the parameters of the Gaussian model are automatically determined by the PyKridge library. We evaluated the accuracy of the adopted Kriging interpolation on the dataset and found it to be acceptable, ensuring the reliability of subsequent analyses. For detailed results, please refer to Appendix D. The parameters of DBSCAN,  $\\epsilon$  and MinPts, are configured as 10 and 100, respectively, after multiple trials. The window size for smoothing is set as 24 hours."
  },
  {
    "sentence": "The deterioration in air quality was possibly due to the poor atmospheric dispersion conditions and the influence of dust storms.",
    "subtitle": "A. Case Study: Air Quality in China",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 2534,
    "para_id": 417,
    "paper_id": 3,
    "2d_coord": [
      0.944599986076355,
      1.748621940612793
    ],
    "MSU_id": 2534,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "Western China. To analyze the air pollution situation in western China further, PA applied the volume highlight tool to select the spatial range of interest. Recall that VolumeSTCube allows us to easily locate the spotlight on the target region by directly pointing to the region on the map. The region was exactly the Xinjiang. PA clearly observed that starting around March, multiple significant air pollution events occurred (Figure 6C). During these events, the air quality in Xinjiang deteriorated notably, possibly due to the poor atmospheric dispersion conditions and the influence of dust storms [65]."
  },
  {
    "sentence": "The propagation process of air pollution expands the impact of air pollution over geographic space and time.",
    "subtitle": "A. Case Study: Air Quality in China",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 2585,
    "para_id": 426,
    "paper_id": 3,
    "2d_coord": [
      1.2364553213119507,
      1.8771865367889404
    ],
    "MSU_id": 2585,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "4) Spatiotemporal Analysis: VolumeSTCube can also support spatiotemporal analysis well because it enables perceiving time and space simultaneously. The evidence was that PA could quickly identify many hotspots in Figure 6B and C. Beyond hotspots, PA could also easily identify the propagation process of air pollution, which expands the impact of air pollution over geographic space and time."
  },
  {
    "sentence": "Mapping temporal trends to geographic space facilitates space-oriented analysis.",
    "subtitle": "A. Case Study: Air Quality in China",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 2622,
    "para_id": 432,
    "paper_id": 3,
    "2d_coord": [
      1.104732871055603,
      1.923201560974121
    ],
    "MSU_id": 2622,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "5) Case Study Summary: This case study demonstrates VolumeSTCube's effectiveness in supporting large-scale spatiotemporal analysis oriented to space, time, and even spatiotemporal patterns. Particularly, the visualization based on the space-time cube enables users to directly map temporal trends to geographic space, facilitating space-oriented analysis. Moreover, VolumeSTCube does not require the trial-and-error parameter adjustment process, allowing for the direct revelation of spatiotemporal patterns through spatial and temporal integrated presentations."
  },
  {
    "sentence": "If undergraduate students were able to complete the tasks successfully after the introduction or tutorials, it stands to reason that domain experts would be even better equipped to utilize the system effectively.",
    "subtitle": "B. User Study",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 2637,
    "para_id": 434,
    "paper_id": 3,
    "2d_coord": [
      1.4754678010940552,
      1.5945284366607666
    ],
    "MSU_id": 2637,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "1) Study Setup: Subjects. Due to the challenge of recruiting a sufficient number of domain experts, we opted to involve undergraduate students. If undergraduate students, who are less familiar with advanced visualization techniques and domain-specific problems, were able to complete the tasks successfully after the introduction or tutorials, it stands to reason that domain experts, with their greater expertise and experience, would be even better equipped to utilize the system effectively."
  },
  {
    "sentence": "These observed results may be attributed to a preference for continuous visual representations along a timeline.",
    "subtitle": "B. User Study",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 2757,
    "para_id": 452,
    "paper_id": 3,
    "2d_coord": [
      1.0209107398986816,
      2.007225275039673
    ],
    "MSU_id": 2757,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "The above questions (tasks) are either space- oriented or spatiotemporal pattern- oriented, but through observation and test, VolumeSTCube has advantages on time- oriented tasks as well compared to the baseline.For Q3,Q4,Q10,Q15,and Q16, the correctness of subjects' answers using VolumeSTCube was slightly higher compared to using the baseline method. The average response time for questions Q9 and Q10 was at least 7 seconds shorter when using VolumeSTCube than when using the baseline. For Q4 and Q9, the Wilcoxon test on the response times of using the two systems results in  $p = 0.03$  (significance) and  $p = 0.06$  (weak significance), respectively. These observed results may be attributed to a preference for continuous visual representations along a timeline (e.g., Figure 6C), which allows for clear and fine division of events, as opposed to discrete visual elements such as stacked disks."
  },
  {
    "sentence": "Continuous visual representations allow for clear and fine division of events.",
    "subtitle": "B. User Study",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 2758,
    "para_id": 452,
    "paper_id": 3,
    "2d_coord": [
      0.9597669839859009,
      1.9147956371307373
    ],
    "MSU_id": 2758,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "The above questions (tasks) are either space- oriented or spatiotemporal pattern- oriented, but through observation and test, VolumeSTCube has advantages on time- oriented tasks as well compared to the baseline.For Q3,Q4,Q10,Q15,and Q16, the correctness of subjects' answers using VolumeSTCube was slightly higher compared to using the baseline method. The average response time for questions Q9 and Q10 was at least 7 seconds shorter when using VolumeSTCube than when using the baseline. For Q4 and Q9, the Wilcoxon test on the response times of using the two systems results in  $p = 0.03$  (significance) and  $p = 0.06$  (weak significance), respectively. These observed results may be attributed to a preference for continuous visual representations along a timeline (e.g., Figure 6C), which allows for clear and fine division of events, as opposed to discrete visual elements such as stacked disks."
  },
  {
    "sentence": "Continuous visual representations are preferred over discrete visual elements such as stacked disks.",
    "subtitle": "B. User Study",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 2759,
    "para_id": 452,
    "paper_id": 3,
    "2d_coord": [
      1.122178316116333,
      1.9654631614685059
    ],
    "MSU_id": 2759,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "The above questions (tasks) are either space- oriented or spatiotemporal pattern- oriented, but through observation and test, VolumeSTCube has advantages on time- oriented tasks as well compared to the baseline.For Q3,Q4,Q10,Q15,and Q16, the correctness of subjects' answers using VolumeSTCube was slightly higher compared to using the baseline method. The average response time for questions Q9 and Q10 was at least 7 seconds shorter when using VolumeSTCube than when using the baseline. For Q4 and Q9, the Wilcoxon test on the response times of using the two systems results in  $p = 0.03$  (significance) and  $p = 0.06$  (weak significance), respectively. These observed results may be attributed to a preference for continuous visual representations along a timeline (e.g., Figure 6C), which allows for clear and fine division of events, as opposed to discrete visual elements such as stacked disks."
  },
  {
    "sentence": "In the future, we plan to implement a rendering parameter adjustment control to alleviate this problem.",
    "subtitle": "B. User Study",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 2769,
    "para_id": 454,
    "paper_id": 3,
    "2d_coord": [
      1.4968589544296265,
      1.2153112888336182
    ],
    "MSU_id": 2769,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "Visualization. All subjects quickly grasped the space- time cube and confirmed the intuitiveness of VolumeSTCube.Moreover, all subjects using VolumeSTCube for analysis experienced minimal occlusion problems and remarked that \"due to the opacity of voxels (actually the volume visualization they meant), they experienced no visual occlusion during analysis.\" Two subjects noted that the opacity of voxels could potentially hinder analyzing low pollution levels, which corresponds to VolumeSTCube's poor performance in Q15. In the future, we plan to implement a rendering parameter adjustment control to alleviate this problem. For example, the mapping of values to transparency and color can be adjusted interactively. Finally, most subjects expressed that surface rendering offered clear boundaries for voxel clusters, aiding in obtaining specific values at spatiotemporal positions and assessing propagation processes. This capability could be difficult to achieve solely with volume rendering. Interestingly, some subjects with strong spatial perception felt relying solely on volume visualization was sufficient."
  },
  {
    "sentence": "This section discusses the implications of VolumeSTCube.",
    "subtitle": "VI. DISCUSSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 2779,
    "para_id": 456,
    "paper_id": 3,
    "2d_coord": [
      1.154081106185913,
      2.0058484077453613
    ],
    "MSU_id": 2779,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "This section discusses the implications, generalizability, and limitations of VolumeSTCube, and posts the future work."
  },
  {
    "sentence": "This section discusses the generalizability of VolumeSTCube.",
    "subtitle": "VI. DISCUSSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 2780,
    "para_id": 456,
    "paper_id": 3,
    "2d_coord": [
      1.1452134847640991,
      1.98020339012146
    ],
    "MSU_id": 2780,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "This section discusses the implications, generalizability, and limitations of VolumeSTCube, and posts the future work."
  },
  {
    "sentence": "This section posts the future work.",
    "subtitle": "VI. DISCUSSION",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 3,
    "msuid": 2782,
    "para_id": 456,
    "paper_id": 3,
    "2d_coord": [
      1.292013168334961,
      1.6223499774932861
    ],
    "MSU_id": 2782,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "This section discusses the implications, generalizability, and limitations of VolumeSTCube, and posts the future work."
  },
  {
    "sentence": "The results further underscore VolumeSTCube's usability, effectiveness, and broad applicability.",
    "subtitle": "A. Implications",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 2791,
    "para_id": 457,
    "paper_id": 3,
    "2d_coord": [
      1.179335117340088,
      1.9746904373168945
    ],
    "MSU_id": 2791,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "A. ImplicationsThe STC, a form of 3D visualization, has historically seen mixed reception in the visualization community, particularly due to inherent occlusion issues [66]. Nonetheless, our study shows that the STC's effectiveness can be enhanced by reducing occlusion through data transformation combined with volume and surface visualizations. Furthermore, to improve the STC's adaptability to large-scale datasets, we design interactions for users to manipulate the STC from time and space dimensions, corresponding to spatial and temporal selection interactions common in 2D views. In the case study, the expert comprehensively analyzed an quality in China, demonstrating VolumeSTCube's effectiveness. The user study employed carefully designed tasks that required participants to utilize both volume and surface visualizations, alongside interactions such as volume spotlight, slicing, and voxel cluster-based techniques, to complete the analyses. The high accuracy and efficiency observed in task completion indicate that participants mastered VolumeSTCube, further underscoring its usability, effectiveness, and broad applicability."
  },
  {
    "sentence": "In the future, we plan to incorporate uncertainty into VolumeSTCube.",
    "subtitle": "D. Limitations and Future Work",
    "category": "CONCLUSION/IMPLICATION",
    "rank": 4,
    "msuid": 2824,
    "para_id": 463,
    "paper_id": 3,
    "2d_coord": [
      1.3858050107955933,
      1.8517234325408936
    ],
    "MSU_id": 2824,
    "paper_info": "Visualizing Large-Scale Spatial Time Series with GeoChron",
    "paragraph_info": "Uncertainty Visualization. Given the inherent uncertainty in the interpolation process, uncertainty visualizations are desirable for reliable analysis, helping assess whether observed patterns are uncertain and if local but important patterns are being overlooked [63]. In the future, we plan to incorporate uncertainty into VolumeSTCube, using methods such as the uncertain volume visualization technique."
  }
]